mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
  if ( y < TFT_globals->dispWin.y1 ) {

	h -= (TFT_globals->dispWin.y1 - y);
	y = TFT_globals->dispWin.y1;
  }

  if ( h < 0 ) h = 0;

  if ( ( y + h ) > (TFT_globals->dispWin.y2 + 1) ) h = TFT_globals->dispWin.y2 - y + 1;

  if ( h == 0 ) h = 1;

  TFT_pushColorRep(disp_handle, TFT_globals, x, y, x, y + h - 1, color, (uint32_t) h);
}



// Local function
//--------------------------------------------------------------------------
static void 
_drawFastHLine(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	int16_t w,
	color_t color)
{
	// clipping
	if ( (y < TFT_globals->dispWin.y1) || (x > TFT_globals->dispWin.x2) ||
		(y > TFT_globals->dispWin.y2) ) return;

	if ( x < TFT_globals->dispWin.x1 ) {
		w -= (TFT_globals->dispWin.x1 - x);
		x = TFT_globals->dispWin.x1;
	}

	if (w < 0) w = 0;
	if ( ( x + w ) > ( TFT_globals->dispWin.x2 + 1 ) ) w = TFT_globals->dispWin.x2 - x + 1;
	if ( w == 0 ) w = 1;

	TFT_pushColorRep(disp_handle, TFT_globals, x, y, x + w - 1, y, color, (uint32_t) w);
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw Fast Vertical Line
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_drawFastVLine(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	int16_t h,
	color_t color)
{
	_drawFastVLine(disp_handle, TFT_globals, x + TFT_globals->dispWin.x1,
		y + TFT_globals->dispWin.y1, h, color);
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw Fast Horizontal Line
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_drawFastHLine(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	int16_t w,
	color_t color) 
{
	_drawFastHLine(disp_handle, TFT_globals, x + TFT_globals->dispWin.x1,
		y + TFT_globals->dispWin.y1, w, color);
}



// Local function
// Bresenham's algorithm - thx wikipedia - speed enhanced by Bodmer this uses
// the eficient FastH/V Line draw routine for segments of 2 pixels or more
//----------------------------------------------------------------------------------
static void 
_drawLine(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x0,
	int16_t y0,
	int16_t x1,
	int16_t y1,
	color_t color)
{
  if ( x0 == x1 ) {

	  if ( y0 <= y1 ) _drawFastVLine(disp_handle, TFT_globals, x0, y0, y1 - y0, color);
	  else _drawFastVLine(disp_handle, TFT_globals, x0, y1, y0 - y1, color);
	  return;
  }
  if ( y0 == y1 ) {
	  if ( x0 <= x1 ) _drawFastHLine(disp_handle, TFT_globals, x0, y0, x1 - x0, color);
	  else _drawFastHLine(disp_handle, TFT_globals, x1, y0, x0 - x1, color);
	  return;
  }

  int steep = 0;
  if ( abs ( y1 - y0 ) > abs ( x1 - x0 ) ) steep = 1;

  if (steep) {

    swap(x0, y0);
    swap(x1, y1);
  }

  if ( x0 > x1 ) {

    swap(x0, x1);
    swap(y0, y1);
  }

  int16_t dx = x1 - x0, dy = abs(y1 - y0);
  int16_t err = dx >> 1, ystep = -1, xs = x0, dlen = 0;

  if ( y0 < y1 ) ystep = 1;

  // Split into steep and not steep for FastH/V separation
  if (steep) {

	for (; x0 <= x1; x0++) {

		dlen++;
		err -= dy;

		if (err < 0) {

			err += dx;

			if (dlen == 1) _drawPixel(disp_handle, TFT_globals, y0, xs, color, 1);

			else _drawFastVLine(disp_handle, TFT_globals, y0, xs, dlen, color);

			dlen = 0; y0 += ystep; xs = x0 + 1;
		}
	}

	if (dlen) _drawFastVLine(disp_handle,TFT_globals, y0, xs, dlen, color);
  }

  else {

	for (; x0 <= x1; x0++) {

		dlen++;
		err -= dy;

		if (err < 0) {
			err += dx;
			if (dlen == 1) _drawPixel(disp_handle, TFT_globals, xs, y0, color, 1);
			else _drawFastHLine(disp_handle,TFT_globals, xs, y0, dlen, color);
			dlen = 0; y0 += ystep; xs = x0 + 1;
		}
	}

	if (dlen) _drawFastHLine(disp_handle, TFT_globals, xs, y0, dlen, color);
  }
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw Line
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_drawLine(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x0,
	int16_t y0,
	int16_t x1,
	int16_t y1,
	color_t color)
{
	_drawLine(disp_handle, TFT_globals, x0 + TFT_globals->dispWin.x1,
		 y0 + TFT_globals->dispWin.y1, x1 + TFT_globals->dispWin.x1,
		 y1 + TFT_globals->dispWin.y1, color);
}



// Local function
// fill a rectangle
//--------------------------------------------------------------------------------
static void 
_fillRect(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	int16_t w,
	int16_t h,
	color_t color)
{
	// clipping
	if ( ( x >= TFT_globals->dispWin.x2 ) || ( y > TFT_globals->dispWin.y2 ) ) return;

	if ( x < TFT_globals->dispWin.x1 ) {
		w -= ( TFT_globals->dispWin.x1 - x );
		x = TFT_globals->dispWin.x1;
	}

	if ( y < TFT_globals->dispWin.y1) {
		h -= ( TFT_globals->dispWin.y1 - y );
		y = TFT_globals->dispWin.y1;
	}

	if ( w < 0 ) w = 0;
	if ( h < 0 ) h = 0;

	if ( ( x + w ) > ( TFT_globals->dispWin.x2 + 1 ) )
		 w = TFT_globals->dispWin.x2 - x + 1;

	if ( ( y + h ) > ( TFT_globals->dispWin.y2 + 1) )
		 h = TFT_globals->dispWin.y2 - y + 1;

	if ( w == 0 ) w = 1;
	if ( h == 0 ) h = 1;

	TFT_pushColorRep(disp_handle, TFT_globals, x, y, x + w - 1,
		 y + h - 1, color, (uint32_t) (h * w) );
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Filled Rectangle
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_fillRect(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	int16_t w,
	int16_t h,
	color_t color) 
{
	_fillRect(disp_handle, TFT_globals, x + TFT_globals->dispWin.x1,
		 y + TFT_globals->dispWin.y1, w, h, color);
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Fill Screen
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_fillScreen(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	color_t color)
{
  TFT_pushColorRep(disp_handle, TFT_globals, 0, 0, TFT_globals->_width-1, TFT_globals->_height-1,
	color, (uint32_t) (TFT_globals->_height * TFT_globals->_width) );
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Fill Window
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_fillWindow(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	color_t color) 
{
	TFT_pushColorRep(disp_handle, TFT_globals, TFT_globals->dispWin.x1,
		TFT_globals->dispWin.y1, TFT_globals->dispWin.x2, TFT_globals->dispWin.y2,
		color, (uint32_t) ( (TFT_globals->dispWin.x2 - TFT_globals->dispWin.x1 + 1) *
		 (TFT_globals->dispWin.y2 - TFT_globals->dispWin.y1 + 1) ) );
}



// ^^^============= Basics drawing functions ================================^^^



// ================ Graphics drawing functions ==================================


// Local function
//-----------------------------------------------------------------------------------
static void 
_drawRect(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint16_t x1,
	uint16_t y1,
	uint16_t w,
	uint16_t h,
	color_t color)
{
  _drawFastHLine(disp_handle, TFT_globals, x1, y1, w, color);
  _drawFastVLine(disp_handle, TFT_globals,  x1 + w - 1, y1, h, color);
  _drawFastHLine(disp_handle, TFT_globals,  x1, y1 + h - 1, w, color);
  _drawFastVLine(disp_handle, TFT_globals,  x1, y1 , h, color);
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw Rectangle
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_drawRect(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint16_t x1,
	uint16_t y1,
	uint16_t w,
	uint16_t h,
	color_t color)
{
	_drawRect(disp_handle, TFT_globals, x1 + TFT_globals->dispWin.x1,
		y1 + TFT_globals->dispWin.y1, w, h, color);
}



// Local function
//-------------------------------------------------------------------------------------------------
static void 
drawCircleHelper(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x0,
	int16_t y0,
	int16_t r,
	uint8_t cornername,
	color_t color)
{
	int16_t f = 1 - r;
	int16_t ddF_x = 1;
	int16_t ddF_y = -2 * r;
	int16_t x = 0;
	int16_t y = r;

