mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
	while (x < y) {

		if (f >= 0) {

			y--;
			ddF_y += 2;
			f += ddF_y;
		}

		x++;
		ddF_x += 2;
		f += ddF_x;

		if (cornername & 0x4) {

			_drawPixel(disp_handle, TFT_globals, x0 + x, y0 + y, color, 0);
			_drawPixel(disp_handle, TFT_globals, x0 + y, y0 + x, color, 0);
		}

		if (cornername & 0x2) {

			_drawPixel(disp_handle, TFT_globals, x0 + x, y0 - y, color, 0);
			_drawPixel(disp_handle, TFT_globals, x0 + y, y0 - x, color, 0);
		}
		if (cornername & 0x8) {

			_drawPixel(disp_handle, TFT_globals, x0 - y, y0 + x, color, 0);
			_drawPixel(disp_handle, TFT_globals, x0 - x, y0 + y, color, 0);
		}

		if (cornername & 0x1) {

			_drawPixel(disp_handle, TFT_globals, x0 - y, y0 - x, color, 0);
			_drawPixel(disp_handle, TFT_globals, x0 - x, y0 - y, color, 0);
		}
	}
}



// Local function
// Used to do circles and roundrects
//----------------------------------------------------------------------------------------------------------------
static void 
fillCircleHelper(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x0,
	int16_t y0,
	int16_t r,
	uint8_t cornername,
	int16_t delta,
	color_t color)
{
	int16_t f = 1 - r;
	int16_t ddF_x = 1;
	int16_t ddF_y = -2 * r;
	int16_t x = 0;
	int16_t y = r;
	int16_t ylm = x0 - r;

	while (x < y) {

		if (f >= 0) {

			if (cornername & 0x1) _drawFastVLine(disp_handle, TFT_globals,
				 x0 + y, y0 - x, 2 * x + 1 + delta, color);

			if (cornername & 0x2) _drawFastVLine(disp_handle, TFT_globals,
				 x0 - y, y0 - x, 2 * x + 1 + delta, color);

			ylm = x0 - y;
			y--;
			ddF_y += 2;
			f += ddF_y;
		}

		x++;
		ddF_x += 2;
		f += ddF_x;

		if ((x0 - x) > ylm) {

			if (cornername & 0x1) _drawFastVLine(disp_handle, TFT_globals,
				 x0 + x, y0 - y, 2 * y + 1 + delta, color);

			if (cornername & 0x2) _drawFastVLine(disp_handle, TFT_globals,
				 x0 - x, y0 - y, 2 * y + 1 + delta, color);
		}
	}
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw Rounded Rectangle
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_drawRoundRect(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	uint16_t w,
	uint16_t h,
	uint16_t r,
	color_t color)
{
	x += TFT_globals->dispWin.x1;
	y += TFT_globals->dispWin.y1;

	// smarter version
	_drawFastHLine(disp_handle, TFT_globals, x + r, y, w - 2 * r, color);		// Top
	_drawFastHLine(disp_handle, TFT_globals, x + r, y + h - 1, w - 2 * r, color);	// Bottom
	_drawFastVLine(disp_handle, TFT_globals, x, y + r, h - 2 * r, color);		// Left
	_drawFastVLine(disp_handle, TFT_globals, x + w - 1, y + r, h - 2 * r, color);	// Right

	// draw four corners
	drawCircleHelper(disp_handle, TFT_globals, x + r, y + r, r, 1, color);
	drawCircleHelper(disp_handle, TFT_globals, x + w - r - 1, y + r, r, 2, color);
	drawCircleHelper(disp_handle, TFT_globals, x + w - r - 1, y + h - r - 1, r, 4, color);
	drawCircleHelper(disp_handle, TFT_globals, x + r, y + h - r - 1, r, 8, color);
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw a Filled Rounded Rectangle
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void TFT_fillRoundRect(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	uint16_t w,
	uint16_t h,
	uint16_t r,
	color_t color)
{
	x += TFT_globals->dispWin.x1;
	y += TFT_globals->dispWin.y1;

	// smarter version
	_fillRect(disp_handle, TFT_globals, x + r, y, w - 2 * r, h, color);

	// draw four corners
	fillCircleHelper(disp_handle, TFT_globals, x + w - r - 1, y + r, r, 1, h - 2 * r - 1, color);
	fillCircleHelper(disp_handle, TFT_globals, x + r, y + r, r, 2, h - 2 * r - 1, color);
}



// Local function
//-----------------------------------------------------------------------------------------------
static void 
_drawLineByAngle(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	int16_t angle,
	uint16_t length,
	color_t color)
{
	_drawLine(disp_handle, TFT_globals, x, y,
		x + length * cos((angle + TFT_globals->_angleOffset) * DEG_TO_RAD),
		y + length * sin((angle + TFT_globals->_angleOffset) * DEG_TO_RAD), color);
}



// Local function
//---------------------------------------------------------------------------------------------------------------
static void 
_DrawLineByAngle(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	int16_t angle,
	uint16_t start,
	uint16_t length,
	color_t color)
{
	_drawLine(disp_handle, TFT_globals, 
		x + start * cos( (angle + TFT_globals->_angleOffset) * DEG_TO_RAD),
		y + start * sin( (angle + TFT_globals->_angleOffset) * DEG_TO_RAD),
		x + (start + length) * cos( (angle + TFT_globals->_angleOffset) * DEG_TO_RAD),
		y + (start + length) * sin( (angle + TFT_globals->_angleOffset) * DEG_TO_RAD), color);
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw a Line by Angle
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_drawLineByAngle(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint16_t x,
	uint16_t y,
	uint16_t start,
	uint16_t len,
	uint16_t angle,
	color_t color)
{
	x += TFT_globals->dispWin.x1;
	y += TFT_globals->dispWin.y1;

	if (start == 0) _drawLineByAngle(disp_handle, TFT_globals, x, y, angle, len, color);

	else _DrawLineByAngle(disp_handle, TFT_globals, x, y, angle, start, len, color);
}



// Local function
// Draw a triangle
//--------------------------------------------------------------------------------------------------------------------
static void 
_drawTriangle(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint16_t x0,
	uint16_t y0,
	uint16_t x1,
	uint16_t y1,
	uint16_t x2,
	uint16_t y2, 
	color_t color)
{
	_drawLine(disp_handle, TFT_globals, x0, y0, x1, y1, color);
	_drawLine(disp_handle, TFT_globals, x1, y1, x2, y2, color);
	_drawLine(disp_handle, TFT_globals, x2, y2, x0, y0, color);
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw a Triangle
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void TFT_drawTriangle(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint16_t x0,
	uint16_t y0,
	uint16_t x1,
	uint16_t y1,
	uint16_t x2,
	uint16_t y2,
	color_t color)
{
	x0 += TFT_globals->dispWin.x1;
	y0 += TFT_globals->dispWin.y1;
	x1 += TFT_globals->dispWin.x1;
	y1 += TFT_globals->dispWin.y1;
	x2 += TFT_globals->dispWin.x1;
	y2 += TFT_globals->dispWin.y1;

	_drawLine(disp_handle, TFT_globals, x0, y0, x1, y1, color);
	_drawLine(disp_handle, TFT_globals, x1, y1, x2, y2, color);
	_drawLine(disp_handle, TFT_globals, x2, y2, x0, y0, color);
}



// Local function
// Fill a triangle
//--------------------------------------------------------------------------------------------------------------------
static void 
_fillTriangle(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint16_t x0,
	uint16_t y0,
	uint16_t x1,
	uint16_t y1,
	uint16_t x2,
	uint16_t y2,
	color_t color)
{
  int16_t a, b, y, last;

