mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
  // Sort coordinates by Y order (y2 >= y1 >= y0)
  if (y0 > y1) {

	swap(y0, y1); swap(x0, x1);
  }

  if (y1 > y2) {

	swap(y2, y1); swap(x2, x1);
  }

  if (y0 > y1) {

	swap(y0, y1); swap(x0, x1);
  }

  if(y0 == y2) { // Handle awkward all-on-same-line case as its own thing

	a = b = x0;
	if (x1 < a)      a = x1;
	else if(x1 > b) b = x1;
	if (x2 < a)      a = x2;
	else if(x2 > b) b = x2;

	_drawFastHLine(disp_handle, TFT_globals, a, y0, b-a+1, color);

	return;
  }

  int16_t
  dx01 = x1 - x0,
  dy01 = y1 - y0,
  dx02 = x2 - x0,
  dy02 = y2 - y0,
  dx12 = x2 - x1,
  dy12 = y2 - y1;
  int32_t
  sa   = 0,
  sb   = 0;

  // For upper part of triangle, find scanline crossings for segments
  // 0-1 and 0-2.  If y1=y2 (flat-bottomed triangle), the scanline y1
  // is included here (and second loop will be skipped, avoiding a /0
  // error there), otherwise scanline y1 is skipped here and handled
  // in the second loop...which also avoids a /0 error here if y0=y1
  // (flat-topped triangle).
  if (y1 == y2) last = y1;   // Include y1 scanline
  else last = y1-1; // Skip it

  for ( y =y0 ; y <= last ; y++ ) {

	a   = x0 + sa / dy01;
	b   = x0 + sb / dy02;

	sa += dx01;
	sb += dx02;

	/* longhand:
	a = x0 + (x1 - x0) * (y - y0) / (y1 - y0);
	b = x0 + (x2 - x0) * (y - y0) / (y2 - y0);
	*/

	if(a > b) swap(a,b);

	_drawFastHLine(disp_handle, TFT_globals, a, y, b-a+1, color);
  }

  // For lower part of triangle, find scanline crossings for segments
  // 0-2 and 1-2.  This loop is skipped if y1=y2.
  sa = dx12 * (y - y1);
  sb = dx02 * (y - y0);
  for(; y<=y2; y++) {

	a   = x1 + sa / dy12;
	b   = x0 + sb / dy02;

	sa += dx12;
	sb += dx02;

	/* longhand:
	a = x1 + (x2 - x1) * (y - y1) / (y2 - y1);
	b = x0 + (x2 - x0) * (y - y0) / (y2 - y0);
	*/

	if(a > b) swap(a,b);

	_drawFastHLine(disp_handle, TFT_globals, a, y, b-a+1, color);
  }
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw a Filled Triangle
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_fillTriangle(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint16_t x0,
	uint16_t y0,
	uint16_t x1,
	uint16_t y1,
	uint16_t x2,
	uint16_t y2,
	color_t color)
{
	_fillTriangle(disp_handle, TFT_globals, 
			x0 + TFT_globals->dispWin.x1, y0 + TFT_globals->dispWin.y1,
			x1 + TFT_globals->dispWin.x1, y1 + TFT_globals->dispWin.y1,
			x2 + TFT_globals->dispWin.x1, y2 + TFT_globals->dispWin.y1,
			color);
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw a Circle
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_drawCircle(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	int radius,
	color_t color)
{
	x += TFT_globals->dispWin.x1;
	y += TFT_globals->dispWin.y1;

	int f = 1 - radius;
	int ddF_x = 1;
	int ddF_y = -2 * radius;
	int x1 = 0;
	int y1 = radius;

	_drawPixel(disp_handle, TFT_globals, x, y + radius, color, 0);
	_drawPixel(disp_handle, TFT_globals, x, y - radius, color, 0);
	_drawPixel(disp_handle, TFT_globals, x + radius, y, color, 0);
	_drawPixel(disp_handle, TFT_globals, x - radius, y, color, 0);

	while(x1 < y1) {

		if (f >= 0) {

			y1--;
			ddF_y += 2;
			f += ddF_y;
		}

		x1++;
		ddF_x += 2;
		f += ddF_x;

		_drawPixel(disp_handle, TFT_globals, x + x1, y + y1, color, 0);
		_drawPixel(disp_handle, TFT_globals, x - x1, y + y1, color, 0);
		_drawPixel(disp_handle, TFT_globals, x + x1, y - y1, color, 0);
		_drawPixel(disp_handle, TFT_globals, x - x1, y - y1, color, 0);
		_drawPixel(disp_handle, TFT_globals, x + y1, y + x1, color, 0);
		_drawPixel(disp_handle, TFT_globals, x - y1, y + x1, color, 0);
		_drawPixel(disp_handle, TFT_globals, x + y1, y - x1, color, 0);
		_drawPixel(disp_handle, TFT_globals, x - y1, y - x1, color, 0);
	}
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw a Filled Circle
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_fillCircle(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	int radius,
	color_t color) 
{
	x += TFT_globals->dispWin.x1;
	y += TFT_globals->dispWin.y1;

	_drawFastVLine(disp_handle, TFT_globals, x, y-radius, 2*radius+1, color);

	fillCircleHelper(disp_handle, TFT_globals, x, y, radius, 3, 0, color);
}



// Local function
//----------------------------------------------------------------------------------------------------------------
static void 
_draw_ellipse_section(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint16_t x,
	uint16_t y,
	uint16_t x0,
	uint16_t y0,
	color_t color,
	uint8_t option)
{
    // upper right
    if ( option & TFT_ELLIPSE_UPPER_RIGHT ) 
	_drawPixel(disp_handle, TFT_globals, x0 + x, y0 - y, color, 0);

    // upper left
    if ( option & TFT_ELLIPSE_UPPER_LEFT ) 
	_drawPixel(disp_handle, TFT_globals, x0 - x, y0 - y, color, 0);

    // lower right
    if ( option & TFT_ELLIPSE_LOWER_RIGHT ) 
	_drawPixel(disp_handle, TFT_globals, x0 + x, y0 + y, color, 0);

    // lower left
    if ( option & TFT_ELLIPSE_LOWER_LEFT ) 
	_drawPixel(disp_handle, TFT_globals, x0 - x, y0 + y, color, 0);
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw an Ellipse
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_drawEllipse(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint16_t x0,
	uint16_t y0,
	uint16_t rx,
	uint16_t ry,
	color_t color,
	uint8_t option)
{
	x0 += TFT_globals->dispWin.x1;
	y0 += TFT_globals->dispWin.y1;

	uint16_t x, y;
	int32_t xchg, ychg;
	int32_t err;
	int32_t rxrx2;
	int32_t ryry2;
	int32_t stopx, stopy;

