mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
	rxrx2 = rx;
	rxrx2 *= rx;
	rxrx2 *= 2;

	ryry2 = ry;
	ryry2 *= ry;
	ryry2 *= 2;

	x = rx;
	y = 0;

	xchg = 1;
	xchg -= rx;
	xchg -= rx;
	xchg *= ry;
	xchg *= ry;

	ychg = rx;
	ychg *= rx;

	err = 0;

	stopx = ryry2;
	stopx *= rx;
	stopy = 0;

	while( stopx >= stopy ) {

		_draw_ellipse_section(disp_handle, TFT_globals,
			 x, y, x0, y0, color, option);

		y++;
		stopy += rxrx2;
		err += ychg;
		ychg += rxrx2;

		if ( 2*err+xchg > 0 ) {

			x--;
			stopx -= ryry2;
			err += xchg;
			xchg += ryry2;
		}
	}

	x = 0;
	y = ry;

	xchg = ry;
	xchg *= ry;

	ychg = 1;
	ychg -= ry;
	ychg -= ry;
	ychg *= rx;
	ychg *= rx;

	err = 0;

	stopx = 0;

	stopy = rxrx2;
	stopy *= ry;

	while( stopx <= stopy ) {

		_draw_ellipse_section(disp_handle, TFT_globals,
			 x, y, x0, y0, color, option);

		x++;
		stopx += ryry2;
		err += xchg;
		xchg += ryry2;

		if ( 2*err+ychg > 0 ) {

			y--;
			stopy -= rxrx2;
			err += ychg;
			ychg += rxrx2;
		}
	}
}



// Local function
//-----------------------------------------------------------------------------------------------------------------------
static void _draw_filled_ellipse_section(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint16_t x,
	uint16_t y,
	uint16_t x0,
	uint16_t y0,
	color_t color,
	uint8_t option)
{
    // upper right
    if ( option & TFT_ELLIPSE_UPPER_RIGHT ) 
	_drawFastVLine(disp_handle, TFT_globals, x0+x, y0-y, y+1, color);

    // upper left
    if ( option & TFT_ELLIPSE_UPPER_LEFT ) 
	_drawFastVLine(disp_handle, TFT_globals, x0-x, y0-y, y+1, color);

    // lower right
    if ( option & TFT_ELLIPSE_LOWER_RIGHT ) 
	_drawFastVLine(disp_handle, TFT_globals, x0+x, y0, y+1, color);

    // lower left
    if ( option & TFT_ELLIPSE_LOWER_LEFT ) 
	_drawFastVLine(disp_handle, TFT_globals, x0-x, y0, y+1, color);
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw an Filled Ellipse
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_fillEllipse(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint16_t x0,
	uint16_t y0,
	uint16_t rx,
	uint16_t ry,
	color_t color,
	uint8_t option)
{
	x0 += TFT_globals->dispWin.x1;
	y0 += TFT_globals->dispWin.y1;

	uint16_t x, y;
	int32_t xchg, ychg;
	int32_t err;
	int32_t rxrx2;
	int32_t ryry2;
	int32_t stopx, stopy;

	rxrx2 = rx;
	rxrx2 *= rx;
	rxrx2 *= 2;

	ryry2 = ry;
	ryry2 *= ry;
	ryry2 *= 2;

	x = rx;
	y = 0;

	xchg = 1;
	xchg -= rx;
	xchg -= rx;
	xchg *= ry;
	xchg *= ry;

	ychg = rx;
	ychg *= rx;

	err = 0;

	stopx = ryry2;
	stopx *= rx;
	stopy = 0;

	while( stopx >= stopy ) {

		_draw_filled_ellipse_section(disp_handle, TFT_globals,
			 x, y, x0, y0, color, option);

		y++;
		stopy += rxrx2;
		err += ychg;
		ychg += rxrx2;

		if ( 2*err+xchg > 0 ) {

			x--;
			stopx -= ryry2;
			err += xchg;
			xchg += ryry2;
		}
	}

	x = 0;
	y = ry;

	xchg = ry;
	xchg *= ry;

	ychg = 1;
	ychg -= ry;
	ychg -= ry;
	ychg *= rx;
	ychg *= rx;

	err = 0;

	stopx = 0;

	stopy = rxrx2;
	stopy *= ry;

	while( stopx <= stopy ) {

		_draw_filled_ellipse_section(disp_handle, TFT_globals,
			 x, y, x0, y0, color, option);

		x++;
		stopx += ryry2;
		err += xchg;
		xchg += ryry2;

		if ( 2*err+ychg > 0 ) {

			y--;
			stopy -= rxrx2;
			err += ychg;
			ychg += rxrx2;
		}
	}
}



// ==== ARC DRAWING ===================================================================



// Local function
//---------------------------------------------------------------------------------------------------------------------------------
static void 
_fillArcOffsetted(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint16_t cx,
	uint16_t cy,
	uint16_t radius,
	uint16_t thickness,
	float start,
	float end, 
	color_t color)
{
	//float sslope = (float)cos_lookup(start) / (float)sin_lookup(start);
	//float eslope = (float)cos_lookup(end) / (float)sin_lookup(end);
	float sslope = (cos(start / TFT_globals->_arcAngleMax * 2 * PI) *
		TFT_globals->_arcAngleMax) / (sin(start / TFT_globals->_arcAngleMax * 2 * PI) *
		TFT_globals->_arcAngleMax) ;

	float eslope = (cos(end/TFT_globals->_arcAngleMax * 2 * PI) *
		TFT_globals->_arcAngleMax) / (sin(end/TFT_globals->_arcAngleMax * 2 * PI) * TFT_globals->_arcAngleMax);

	if (end == 360) eslope = -1000000;

	int ir2 = (radius - thickness) * (radius - thickness);
	int or2 = radius * radius;

	for (int x = -radius; x <= radius; x++) {

		for (int y = -radius; y <= radius; y++) {

			int x2 = x * x;
			int y2 = y * y;

			if (
				(x2 + y2 < or2 && x2 + y2 >= ir2) &&
				(
				(y > 0 && start < 180 && x <= y * sslope) ||
				(y < 0 && start > 180 && x >= y * sslope) ||
				(y < 0 && start <= 180) ||
				(y == 0 && start <= 180 && x < 0) ||
				(y == 0 && start == 0 && x > 0)
				) &&
				(
				(y > 0 && end < 180 && x >= y * eslope) ||
				(y < 0 && end > 180 && x <= y * eslope) ||
				(y > 0 && end >= 180) ||
				(y == 0 && end >= 180 && x < 0) ||
				(y == 0 && start == 0 && x > 0)
				)
				)
				_drawPixel(disp_handle, TFT_globals, cx+x, cy+y, color, 0);
		}
	}
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw an Arc
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_drawArc(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint16_t cx,
	uint16_t cy,
	uint16_t r,
	uint16_t th,
	float start,
	float end,
	color_t color,
	color_t fillcolor)
{
	cx += TFT_globals->dispWin.x1;
	cy += TFT_globals->dispWin.y1;

	if (th < 1) th = 1;
	if (th > r) th = r;

	int f = TFT_compare_colors(fillcolor, color);

	float astart = fmodf(start, TFT_globals->_arcAngleMax);
	float aend = fmodf(end, TFT_globals->_arcAngleMax);

	astart += TFT_globals->_angleOffset;
	aend += TFT_globals->_angleOffset;

	if (astart < 0) astart += (float)360;
	if (aend < 0) aend += (float)360;

	if (aend == 0) aend = (float)360;

