mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
	if (astart > aend) {

		_fillArcOffsetted(disp_handle, TFT_globals,
				cx, cy, r, th, astart, TFT_globals->_arcAngleMax, fillcolor);

		_fillArcOffsetted(disp_handle, TFT_globals,
				cx, cy, r, th, 0, aend, fillcolor);

		if (f) {
			_fillArcOffsetted(disp_handle, TFT_globals,
				cx, cy, r, 1, astart, TFT_globals->_arcAngleMax, color);

			_fillArcOffsetted(disp_handle, TFT_globals,
				cx, cy, r, 1, 0, aend, color);

			_fillArcOffsetted(disp_handle, TFT_globals,
				cx, cy, r-th, 1, astart, TFT_globals->_arcAngleMax, color);

			_fillArcOffsetted(disp_handle, TFT_globals,
				cx, cy, r-th, 1, 0, aend, color);
		}
	}

	else {
		_fillArcOffsetted(disp_handle, TFT_globals,
			cx, cy, r, th, astart, aend, fillcolor);

		if (f) {
			_fillArcOffsetted(disp_handle, TFT_globals,
				cx, cy, r, 1, astart, aend, color);

			_fillArcOffsetted(disp_handle, TFT_globals,
				cx, cy, r-th, 1, astart, aend, color);
		}
	}

	if (f) {
		_drawLine(disp_handle, TFT_globals,
			cx + (r-th) * cos(astart * DEG_TO_RAD),
			cy + (r-th) * sin(astart * DEG_TO_RAD),
			cx + (r-1) * cos(astart * DEG_TO_RAD),
			cy + (r-1) * sin(astart * DEG_TO_RAD), color);

		_drawLine(disp_handle, TFT_globals,
			cx + (r-th) * cos(aend * DEG_TO_RAD),
			cy + (r-th) * sin(aend * DEG_TO_RAD),
			cx + (r-1) * cos(aend * DEG_TO_RAD),
			cy + (r-1) * sin(aend * DEG_TO_RAD), color);
	}
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw an Polygon
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void TFT_drawPolygon(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int cx,
	int cy,
	int sides,
	int diameter,
	color_t color,
	color_t fill,
	int rot,
	uint8_t th)
{
	cx += TFT_globals->dispWin.x1;
	cy += TFT_globals->dispWin.y1;

	int deg = rot - TFT_globals->_angleOffset;
	int f = TFT_compare_colors(fill, color);

	if (sides < MIN_POLIGON_SIDES) sides = MIN_POLIGON_SIDES;	// This ensures the minimum side number
	if (sides > MAX_POLIGON_SIDES) sides = MAX_POLIGON_SIDES;	// This ensures the maximum side number

	int Xpoints[sides], Ypoints[sides];							// Set the arrays based on the number of sides entered
	int rads = 360 / sides;										// This equally spaces the points.

	for (int idx = 0; idx < sides; idx++) {

		Xpoints[idx] = cx + sin((float)(idx*rads + deg) * deg_to_rad) * diameter;
		Ypoints[idx] = cy + cos((float)(idx*rads + deg) * deg_to_rad) * diameter;
	}

	// Draw the polygon on the screen.
	if (f) {

		for(int idx = 0; idx < sides; idx++) {

			if((idx+1) < sides) _fillTriangle(disp_handle, TFT_globals,
				cx, cy, Xpoints[idx], Ypoints[idx], Xpoints[idx+1], Ypoints[idx+1], fill);

			else _fillTriangle(disp_handle, TFT_globals,
				cx, cy, Xpoints[idx], Ypoints[idx], Xpoints[0], Ypoints[0], fill);
		}
	}

	if (th) {

		for (int n=0; n<th; n++) {

			if (n > 0) {

				for (int idx = 0; idx < sides; idx++) {

					Xpoints[idx] = cx + sin((float)(idx*rads + deg) * deg_to_rad) * (diameter-n);
					Ypoints[idx] = cy + cos((float)(idx*rads + deg) * deg_to_rad) * (diameter-n);
				}
			}

			for(int idx = 0; idx < sides; idx++) {

				if( (idx+1) < sides)
					_drawLine(disp_handle, TFT_globals,
						Xpoints[idx], Ypoints[idx],
						Xpoints[idx+1], Ypoints[idx+1], color); // draw the lines

				else
					_drawLine(disp_handle, TFT_globals,
						Xpoints[idx],Ypoints[idx],
						Xpoints[0], Ypoints[0], color); // finishes the last line to close up the polygon.
			}
		}
	}
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Draw an Star
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_drawStar(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int cx,
	int cy,
	int diameter,
	color_t color,
	bool fill,
	float factor)
{
	cx += TFT_globals->dispWin.x1;
	cy += TFT_globals->dispWin.y1;

	factor = constrain(factor, 1.0, 4.0);
	uint8_t sides = 5;
	uint8_t rads = 360 / sides;

	int Xpoints_O[sides], Ypoints_O[sides], Xpoints_I[sides], Ypoints_I[sides];//Xpoints_T[5], Ypoints_T[5];

	for(int idx = 0; idx < sides; idx++) {

		// makes the outer points
		Xpoints_O[idx] = cx + sin((float)(idx*rads + 72) * deg_to_rad) * diameter;
		Ypoints_O[idx] = cy + cos((float)(idx*rads + 72) * deg_to_rad) * diameter;

		// makes the inner points
		Xpoints_I[idx] = cx + sin((float)(idx*rads + 36) * deg_to_rad) * ((float)(diameter)/factor);

		// 36 is half of 72, and this will allow the inner and outer points to line up like a triangle.
		Ypoints_I[idx] = cy + cos((float)(idx*rads + 36) * deg_to_rad) * ((float)(diameter)/factor);
	}

	for(int idx = 0; idx < sides; idx++) {

		if((idx+1) < sides) {

			if(fill) {// this part below should be self explanatory. It fills in the star.

				_fillTriangle(disp_handle, TFT_globals, cx ,cy,
					Xpoints_I[idx], Ypoints_I[idx], Xpoints_O[idx], Ypoints_O[idx], color);

				_fillTriangle(disp_handle, TFT_globals, cx ,cy,
					Xpoints_O[idx], Ypoints_O[idx], Xpoints_I[idx+1], Ypoints_I[idx+1], color);
			}

			else {

				_drawLine(disp_handle, TFT_globals, Xpoints_O[idx], Ypoints_O[idx],
					 Xpoints_I[idx+1], Ypoints_I[idx+1], color);

				_drawLine(disp_handle, TFT_globals, Xpoints_I[idx], Ypoints_I[idx],
					Xpoints_O[idx], Ypoints_O[idx], color);
			}
		}

		else {

			if(fill) {

				_fillTriangle(disp_handle, TFT_globals, cx, cy, Xpoints_I[0], Ypoints_I[0],
					 Xpoints_O[idx], Ypoints_O[idx], color);
				_fillTriangle(disp_handle, TFT_globals, cx, cy, Xpoints_O[idx], Ypoints_O[idx],
					 Xpoints_I[idx], Ypoints_I[idx], color);
			}

			else {
				_drawLine(disp_handle, TFT_globals, Xpoints_O[idx], Ypoints_O[idx],
					Xpoints_I[idx], Ypoints_I[idx], color);

				_drawLine(disp_handle, TFT_globals, Xpoints_I[0], Ypoints_I[0],
					Xpoints_O[idx], Ypoints_O[idx], color);
			}
		}
	}
}



