mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
// ================ Font and string functions ==================================



// Local function
//--------------------------------------------------------
static int 
load_file_font(TFTGlobals_t* TFT_globals,
	const char* fontfile,
	int info)
{
	int err = 0;
	char err_msg[256] = {'\0'};

	if (TFT_globals->userfont != NULL) {

		free(TFT_globals->userfont);
		TFT_globals->userfont = NULL;
	}

    struct stat sb;

    // Open the file
    FILE *fhndl = fopen(fontfile, "r");

    if (!fhndl) {

    	sprintf(err_msg, "Error opening font file '%s'", fontfile);
		err = 1;
		goto exit;
    }

	// Get file size
    if (stat(fontfile, &sb) != 0) {

    	sprintf(err_msg, "Error getting font file size");
		err = 2;
		goto exit;
    }

	int fsize = sb.st_size;

	if (fsize < 30) {

		sprintf(err_msg, "Error getting font file size");
		err = 3;
		goto exit;
	}

	TFT_globals->userfont = malloc(fsize+4);

	if (TFT_globals->userfont == NULL) {

		sprintf(err_msg, "Font memory allocation error");
		fclose(fhndl);
		err = 4;
		goto exit;
	}

	int read = fread(TFT_globals->userfont, 1, fsize, fhndl);

	fclose(fhndl);

	if (read != fsize) {

		sprintf(err_msg, "Font read error");
		err = 5;
		goto exit;
	}

	TFT_globals->userfont[read] = 0;

	if (strstr((char *)(TFT_globals->userfont+read-8), "RPH_font") == NULL) {

		sprintf(err_msg, "Font ID not found");
		err = 6;
		goto exit;
	}

	// Check size
	int size = 0;
	int numchar = 0;
	int width = TFT_globals->userfont[0];
	int height = TFT_globals->userfont[1];
	uint8_t first = 255;
	uint8_t last = 0;
	//int offst = 0;
	int pminwidth = 255;
	int pmaxwidth = 0;

	if (width != 0) {

		// Fixed font
		numchar = TFT_globals->userfont[3];
		first = TFT_globals->userfont[2];
		last = first + numchar - 1;
		size = ((width * height * numchar) / 8) + 4;
	}

	else {
		// Proportional font
		size = 4; // point at first char data
		uint8_t charCode;
		int charwidth;

		do {

		    charCode = TFT_globals->userfont[size];
		    charwidth = TFT_globals->userfont[size+2];

		    if (charCode != 0xFF) {

		    	numchar++;
		    	if (charwidth != 0) size += ((((charwidth * TFT_globals->userfont[size+3])-1) / 8) + 7);
		    	else size += 6;

		    	if (info) {

	    			if (charwidth > pmaxwidth) pmaxwidth = charwidth;
	    			if (charwidth < pminwidth) pminwidth = charwidth;
	    			if (charCode < first) first = charCode;
	    			if (charCode > last) last = charCode;
	    		}
		    }

		    else size++;

		  } while ((size < (read-8)) && (charCode != 0xFF));
	}

	if (size != (read-8)) {

		sprintf(err_msg, "Font size error: found %d expected %d)", size, (read-8));

		err = 7;
		goto exit;
	}

	if (info) {

		if (width != 0) {

			printf("Fixed width font:\r\n  size: %d  width: %d  height: %d  characters: %d (%d~%d)\n",
					size, width, height, numchar, first, last);
		}

		else {

			printf("Proportional font:\r\n  size: %d  width: %d~%d  height: %d  characters: %d (%d~%d)\n",
					size, pminwidth, pmaxwidth, height, numchar, first, last);
		}
	}

exit:
	if (err) {

		if (TFT_globals->userfont) {

			free(TFT_globals->userfont);
			TFT_globals->userfont = NULL;
		}

		if (info) printf("Error: %d [%s]\r\n", err, err_msg);
	}

	return err;
}



// Local function
//------------------------------------------------
int compile_font_file(TFTGlobals_t* TFT_globals,
	char *fontfile,
	uint8_t dbg)
{
	int err = 0;
	char err_msg[128] = {'\0'};
	char outfile[128] = {'\0'};
	size_t len;

	struct stat sb;
	FILE *ffd = NULL;
	FILE *ffd_out = NULL;
	char *sourcebuf = NULL;

	len = strlen(fontfile);

	// check here that filename end with ".c".
	if ((len < 3) || (len > 125) || (strcmp(fontfile + len - 2, ".c") != 0)) {

		sprintf(err_msg, "not a .c file");
		err = 1;
		goto exit;
	}

	sprintf(outfile, "%s", fontfile);
	sprintf(outfile+strlen(outfile)-1, "fon");

	// Open the source file
	if (stat(fontfile, &sb) != 0) {

    	sprintf(err_msg, "Error opening source file '%s'", fontfile);

    	err = 2;
		goto exit;
	}

	// Open the file
	ffd = fopen(fontfile, "rb");

	if (!ffd) {

    		sprintf(err_msg, "Error opening source file '%s'", fontfile);
    		err = 3;
		goto exit;
	}

	// Open the font file
	ffd_out = fopen(outfile, "wb");

	if (!ffd_out) {

		sprintf(err_msg, "error opening destination file");
		err = 4;
		goto exit;
	}

	// Get file size
	int fsize = sb.st_size;

	if (fsize <= 0) {

		sprintf(err_msg, "source file size error");
		err = 5;
		goto exit;
	}

	sourcebuf = malloc(fsize+4);

	if (sourcebuf == NULL) {

		sprintf(err_msg, "memory allocation error");
		err = 6;
		goto exit;
	}

	char *fbuf = sourcebuf;

	int rdsize = fread(fbuf, 1, fsize, ffd);
	fclose(ffd);
	ffd = NULL;

	if (rdsize != fsize) {

		sprintf(err_msg, "error reading from source file");
		err = 7;
		goto exit;
	}

	*(fbuf+rdsize) = '\0';

	fbuf = strchr(fbuf, '{');		// beginning of font data
	char *fend = strstr(fbuf, "};");	// end of font data

	if ((fbuf == NULL) || (fend == NULL) || ((fend-fbuf) < 22)) {

		sprintf(err_msg, "wrong source file format");
		err = 8;
		goto exit;
	}

	fbuf++;
	*fend = '\0';
	char hexstr[5] = {'\0'};
	int lastline = 0;

	fbuf = strstr(fbuf, "0x");
	int size = 0;
	char *nextline;
	char *numptr;

	int bptr = 0;

	while ( (fbuf != NULL) && (fbuf < fend) && (lastline == 0) ) {

		nextline = strchr(fbuf, '\n'); // beginning of the next line

		if (nextline == NULL) {
			nextline = fend-1;
			lastline++;
		}

		else nextline++;

		while (fbuf < nextline) {

			numptr = strstr(fbuf, "0x");

			if ((numptr == NULL) || ((fbuf+4) > nextline)) numptr = strstr(fbuf, "0X");

			if ((numptr != NULL) && ((numptr+4) <= nextline)) {

				fbuf = numptr;

				if (bptr >= 128) {

					// buffer full, write to file
                   			 if (fwrite(outfile, 1, 128, ffd_out) != 128) goto error;

					bptr = 0;
					size += 128;
				}

				memcpy(hexstr, fbuf, 4);
				hexstr[4] = 0;
				outfile[bptr++] = (uint8_t)strtol(hexstr, NULL, 0);
				fbuf += 4;
			}

			else fbuf = nextline;
		}

		fbuf = nextline;
	}

	if (bptr > 0) {

