mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
		size += bptr;

        if (fwrite(outfile, 1, bptr, ffd_out) != bptr) goto error;

	}

	// write font ID
	sprintf(outfile, "RPH_font");

	if (fwrite(outfile, 1, 8, ffd_out) != 8) goto error;

	fclose(ffd_out);
	ffd_out = NULL;

	// === Test compiled font ===
	sprintf(outfile, "%s", fontfile);
	sprintf(outfile+strlen(outfile)-1, "fon");

	uint8_t *uf = TFT_globals->userfont; // save userfont pointer
	TFT_globals->userfont = NULL;

	if (load_file_font(TFT_globals, outfile, 1) != 0) {

		sprintf(err_msg, "Error compiling file!");
		err = 10;
	}

	else {

		free(TFT_globals->userfont);
		sprintf(err_msg, "File compiled successfully.");
	}

	TFT_globals->userfont = uf; // restore userfont

	goto exit;

error:
	sprintf(err_msg, "error writing to destination file");
	err = 9;

exit:
	if (sourcebuf) free(sourcebuf);
	if (ffd) fclose(ffd);
	if (ffd_out) fclose(ffd_out);

	if (dbg) printf("%s\r\n", err_msg);

	return err;
}



// -----------------------------------------------------------------------------------------
// Individual Proportional Font Character Format:
// -----------------------------------------------------------------------------------------
// Character Code
// yOffset				(start Y of visible pixels)
// Width				(width of the visible pixels)
// Height				(height of the visible pixels)
// xOffset				(start X of visible pixels)
// xDelta				(the distance to move the cursor. Effective width of the character.)
// Data[n]
// -----------------------------------------------------------------------------------------

//---------------------------------------------------------------------------------------------
// Character drawing rectangle is (0, 0) (xDelta-1, cfont.y_size-1)
// Character visible pixels rectangle is (xOffset, yOffset) (xOffset+Width-1, yOffset+Height-1)
//---------------------------------------------------------------------------------------------



// Local function
//----------------------------------
void getFontCharacters(uint8_t *buf)
{
    if (cfont.bitmap == 2) {

    	// For 7 segment font only characters 0,1,2,3,4,5,6,7,8,9, . , - , : , / are available.

		for (uint8_t n=0; n < 11; n++) {

			buf[n] = n + 0x30;
		}

		buf[11] = '.';
		buf[12] = '-';
		buf[13] = '/';
		buf[14] = '\0';

		return;
    }

    if (cfont.x_size > 0) {

		for (uint8_t n=0; n < cfont.numchars; n++) {

			buf[n] = cfont.offset + n;
		}

		buf[cfont.numchars] = '\0';
		return;
	}

	uint16_t tempPtr = 4; // point at first char data
	uint8_t cc, cw, ch, n;

	n = 0;
	cc = cfont.font[tempPtr++];

	while (cc != 0xFF)  {

    		cfont.numchars++;
       		tempPtr++;

       		cw = cfont.font[tempPtr++];
       		ch = cfont.font[tempPtr++];

        	tempPtr++;
        	tempPtr++;

		if (cw != 0) {

			// packed bits
			tempPtr += (((cw * ch)-1) / 8) + 1;
		}

		buf[n++] = cc;
		cc = cfont.font[tempPtr++];
	}

	buf[n] = '\0';
}


// Local function
// Set max width & height of the proportional font
//-----------------------------
static void 
getMaxWidthHeight()
{
	uint16_t tempPtr = 4; // point at first char data
	uint8_t cc, cw, ch, cd, cy;

	cfont.numchars = 0;
	cfont.max_x_size = 0;

	cc = cfont.font[tempPtr++];

	while (cc != 0xFF)  {

		cfont.numchars++;

 		cy = cfont.font[tempPtr++];
 		cw = cfont.font[tempPtr++];
		ch = cfont.font[tempPtr++];

       		tempPtr++;

       		cd = cfont.font[tempPtr++];

		cy += ch;

		if (cw > cfont.max_x_size) cfont.max_x_size = cw;
		if (cd > cfont.max_x_size) cfont.max_x_size = cd;

		if (ch > cfont.y_size) cfont.y_size = ch;
		if (cy > cfont.y_size) cfont.y_size = cy;

		if (cw != 0) {

			// packed bits
			tempPtr += (((cw * ch)-1) / 8) + 1;
		}

		cc = cfont.font[tempPtr++];
	}

	cfont.size = tempPtr;
}


// Local function
// Return the Glyph data for an individual character in the proportional font
//------------------------------------
static uint8_t 
getCharPtr(TFTGlobals_t* TFT_globals, uint8_t c)
{
  uint16_t tempPtr = 4; // point at first char data

  do {
	fontChar.charCode = cfont.font[tempPtr++];

	if (fontChar.charCode == 0xFF) return 0;

	fontChar.adjYOffset = cfont.font[tempPtr++];
	fontChar.width = cfont.font[tempPtr++];
	fontChar.height = cfont.font[tempPtr++];
	fontChar.xOffset = cfont.font[tempPtr++];
	fontChar.xOffset = fontChar.xOffset < 0x80 ? fontChar.xOffset : -(0xFF - fontChar.xOffset);
	fontChar.xDelta = cfont.font[tempPtr++];

	if (c != fontChar.charCode && fontChar.charCode != 0xFF) {

		if (fontChar.width != 0) {

		// packed bits
		tempPtr += (((fontChar.width * fontChar.height)-1) / 8) + 1;
		}
	}

  } while ((c != fontChar.charCode) && (fontChar.charCode != 0xFF));

  fontChar.dataPtr = tempPtr;

  if (c == fontChar.charCode) {

	if (TFT_globals->font_forceFixed > 0) {

		// fix width & offset for forced fixed width
		fontChar.xDelta = cfont.max_x_size;
		fontChar.xOffset = (fontChar.xDelta - fontChar.width) / 2;
	}
  }

  else return 0;

  return 1;
}



/*
//-----------------------
static void _testFont() {
  if (cfont.x_size) {
	  printf("FONT TEST: fixed font\r\n");
	  return;
  }
  uint16_t tempPtr = 4; // point at first char data
  uint8_t c = 0x20;
  for (c=0x20; c <0xFF; c++) {
	fontChar.charCode = cfont.font[tempPtr++];
    if (fontChar.charCode == 0xFF) break;
    if (fontChar.charCode != c) {
    	printf("FONT TEST: last sequential char: %d, expected %d\r\n", fontChar.charCode, c);
    	break;
    }
    c = fontChar.charCode;
    fontChar.adjYOffset = cfont.font[tempPtr++];
    fontChar.width = cfont.font[tempPtr++];
    fontChar.height = cfont.font[tempPtr++];
    fontChar.xOffset = cfont.font[tempPtr++];
    fontChar.xOffset = fontChar.xOffset < 0x80 ? fontChar.xOffset : -(0xFF - fontChar.xOffset);
    fontChar.xDelta = cfont.font[tempPtr++];

    if (fontChar.charCode != 0xFF) {
      if (fontChar.width != 0) {
        // packed bits
        tempPtr += (((fontChar.width * fontChar.height)-1) / 8) + 1;
      }
    }
  }
  printf("FONT TEST: W=%d  H=%d last char: %d [%c]; length: %d\r\n", cfont.max_x_size, cfont.y_size, c, c, tempPtr);
}
*/



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Set Font
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void TFT_setFont(TFTGlobals_t* TFT_globals,
	uint8_t font,
	const char *font_file)
{
  cfont.font = NULL;

  if (font == FONT_7SEG) {

	cfont.bitmap = 2;
	cfont.x_size = 24;
	cfont.y_size = 6;
	cfont.offset = 0;
	cfont.color  = TFT_globals->_fg;
  }

  else {

	  if (font == USER_FONT) {

		  if (load_file_font(TFT_globals, font_file, 0) != 0) cfont.font = tft_DefaultFont;
		  else cfont.font = TFT_globals->userfont;
	  }

	  else if (font == DEJAVU18_FONT) cfont.font = tft_Dejavu18;
	  else if (font == DEJAVU24_FONT) cfont.font = tft_Dejavu24;
	  else if (font == UBUNTU16_FONT) cfont.font = tft_Ubuntu16;
	  else if (font == COMIC24_FONT) cfont.font = tft_Comic24;
	  else if (font == MINYA24_FONT) cfont.font = tft_minya24;
	  else if (font == TOONEY32_FONT) cfont.font = tft_tooney32;
	  else if (font == SMALL_FONT) cfont.font = tft_SmallFont;
	  else if (font == DEF_SMALL_FONT) cfont.font = tft_def_small;
	  else cfont.font = tft_DefaultFont;

	  cfont.bitmap = 1;
	  cfont.x_size = cfont.font[0];
	  cfont.y_size = cfont.font[1];

	  if (cfont.x_size > 0) {

		  cfont.offset = cfont.font[2];
		  cfont.numchars = cfont.font[3];
		  cfont.size = cfont.x_size * cfont.y_size * cfont.numchars;
	  }

	  else {
		  cfont.offset = 4;
		  getMaxWidthHeight();
	  }
	  //_testFont();
  }
}



// -----------------------------------------------------------------------------------------
// Individual Proportional Font Character Format:
// -----------------------------------------------------------------------------------------
// Character Code
// yOffset				(start Y of visible pixels)
// Width				(width of the visible pixels)
// Height				(height of the visible pixels)
// xOffset				(start X of visible pixels)
// xDelta				(the distance to move the cursor. Effective width of the character.)
// Data[n]
// -----------------------------------------------------------------------------------------



//---------------------------------------------------------------------------------------------
// Character drawing rectangle is (0, 0) (xDelta-1, cfont.y_size-1)
// Character visible pixels rectangle is (xOffset, yOffset) (xOffset+Width-1, yOffset+Height-1)
//---------------------------------------------------------------------------------------------

// print non-rotated proportional character
// character is already in fontChar
//----------------------------------------------
static int 
printProportionalChar(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int x,
	int y)
{
	uint8_t ch = 0;
	int i, j, char_width;

	char_width = ((fontChar.width > fontChar.xDelta) ? fontChar.width : fontChar.xDelta);

	if ( (TFT_globals->font_buffered_char) && (!TFT_globals->font_transparent) ) {

		int len, bufPos;

		// === buffer Glyph data for faster sending ===
		len = char_width * cfont.y_size;

		color_t *color_line = heap_caps_malloc(len*3, MALLOC_CAP_DMA);

