mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
		if (color_line) {

			// fill with background color
			for (int n = 0; n < len; n++) {

				color_line[n] = TFT_globals->_bg;
			}

			// set character pixels to foreground color
			uint8_t mask = 0x80;

			for (j=0; j < fontChar.height; j++) {

				for (i=0; i < fontChar.width; i++) {

					if (((i + (j*fontChar.width)) % 8) == 0) {
						mask = 0x80;
						ch = cfont.font[fontChar.dataPtr++];
					}

					if ((ch & mask) != 0) {

						// visible pixel
						bufPos = ((j + fontChar.adjYOffset) * char_width) + (fontChar.xOffset + i);  // bufY + bufX
						color_line[bufPos] = TFT_globals->_fg;
						/*
						bufY = (j + fontChar.adjYOffset) * char_width;
						bufX = fontChar.xOffset + i;
						if ((bufX < 0) || (bufX > char_width)) {
							printf("[%c] X ERR: %d\r\n", fontChar.charCode, bufX);
						}
						bufPos = bufY + bufX;
						if ((bufPos < len) && (bufPos > 0)) color_line[bufPos] = _fg;
						else printf("[%c] ERR: %d > %d  W=%d  H=%d  bufX=%d  bufY=%d  X=%d  Y=%d\r\n",
								fontChar.charCode, bufPos, len, char_width, cfont.y_size, bufX, bufY, fontChar.xOffset + i, j + fontChar.adjYOffset);
						*/
					}

					mask >>= 1;
				}
			}

			send_data(disp_handle, TFT_globals , x, y, x + char_width - 1, y + cfont.y_size - 1, len, color_line);

			free(color_line);

			return char_width;
		}
	}

	int cx, cy;

	if (!TFT_globals->font_transparent) _fillRect(disp_handle, TFT_globals, x, y, char_width+1, cfont.y_size, TFT_globals->_bg);

	// draw Glyph
	uint8_t mask = 0x80;

	for (j=0; j < fontChar.height; j++) {

		for (i=0; i < fontChar.width; i++) {

			if (((i + (j*fontChar.width)) % 8) == 0) {

				mask = 0x80;
				ch = cfont.font[fontChar.dataPtr++];
			}

			if ((ch & mask) !=0) {

				cx = (uint16_t)(x+fontChar.xOffset+i);
				cy = (uint16_t)(y+j+fontChar.adjYOffset);

				_drawPixel(disp_handle, TFT_globals, cx, cy, TFT_globals->_fg, 0);
			}

			mask >>= 1;
		}
	}

	return char_width;
}



// non-rotated fixed width character
//----------------------------------------------
static void 
printChar(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint8_t c,
	int x,
	int y)
{
	uint8_t i, j, ch, fz, mask;
	uint16_t k, temp, cx, cy, len;

	// fz = bytes per char row
	fz = cfont.x_size/8;
	if (cfont.x_size % 8) fz++;

	// get character position in buffer
	temp = ((c-cfont.offset)*((fz)*cfont.y_size))+4;

	if ((TFT_globals->font_buffered_char) && (!TFT_globals->font_transparent)) {

		// === buffer Glyph data for faster sending ===
		len = cfont.x_size * cfont.y_size;

		color_t *color_line = heap_caps_malloc(len*3, MALLOC_CAP_DMA);

		if (color_line) {

			// fill with background color
			for (int n = 0; n < len; n++) {

				color_line[n] = TFT_globals->_bg;
			}

			// set character pixels to foreground color
			for (j=0; j<cfont.y_size; j++) {

				for (k=0; k < fz; k++) {

					ch = cfont.font[temp+k];
					mask=0x80;

					for (i=0; i<8; i++) {

						if ((ch & mask) !=0) color_line[(j*cfont.x_size) + (i+(k*8))] = TFT_globals->_fg;
						mask >>= 1;
					}
				}

				temp += (fz);
			}

			// send to display in one transaction

			send_data(disp_handle, TFT_globals, x, y, x+cfont.x_size-1, y+cfont.y_size-1, len, color_line);

			free(color_line);

			return;
		}
	}

	if (!TFT_globals->font_transparent) _fillRect(disp_handle, TFT_globals, x, y, cfont.x_size, cfont.y_size, TFT_globals->_bg);

	for (j=0; j<cfont.y_size; j++) {

		for (k=0; k < fz; k++) {

			ch = cfont.font[temp+k];
			mask=0x80;

			for (i=0; i<8; i++) {

				if ((ch & mask) !=0) {

					cx = (uint16_t)(x+i+(k*8));
					cy = (uint16_t)(y+j);

					_drawPixel(disp_handle, TFT_globals, cx, cy, TFT_globals->_fg, 0);
				}

				mask >>= 1;
			}
		}

		temp += (fz);
	}
}



// print rotated proportional character
// character is already in fontChar
//---------------------------------------------------
static int 
rotatePropChar(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int x,
	int y, 
	int offset) 
{
	uint8_t ch = 0;

	double radian = TFT_globals->font_rotate * DEG_TO_RAD;

	float cos_radian = cos(radian);
	float sin_radian = sin(radian);

	uint8_t mask = 0x80;

	for (int j=0; j < fontChar.height; j++) {

		for (int i=0; i < fontChar.width; i++) {

			if (((i + (j*fontChar.width)) % 8) == 0) {

			mask = 0x80;
			ch = cfont.font[fontChar.dataPtr++];
			}

		int newX = (int)(x + (((offset + i) * cos_radian) - ((j+fontChar.adjYOffset)*sin_radian)));
		int newY = (int)(y + (((j+fontChar.adjYOffset) * cos_radian) + ((offset + i) * sin_radian)));

		if ((ch & mask) != 0) _drawPixel(disp_handle, TFT_globals, newX,newY, TFT_globals->_fg, 0);
		else if (!TFT_globals->font_transparent) _drawPixel(disp_handle, TFT_globals, newX, newY, TFT_globals->_bg, 0);

		mask >>= 1;
		}
	}
  return fontChar.xDelta+1;
}



// rotated fixed width character
//--------------------------------------------------------
static void 
rotateChar(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint8_t c,
	int x,
	int y,
	int pos) 
{
	uint8_t i,j,ch,fz,mask;
	uint16_t temp;
	int newx,newy;
	double radian = TFT_globals->font_rotate * 0.0175;
	float cos_radian = cos(radian);
	float sin_radian = sin(radian);
	int zz;

	if( cfont.x_size < 8 ) fz = cfont.x_size;
	else fz = cfont.x_size / 8;

	temp = ( (c-cfont.offset) * ((fz)*cfont.y_size) ) + 4;

	for ( j = 0; j < cfont.y_size ; j++ ) {

		for ( zz = 0 ; zz < (fz) ; zz++ ) {

			ch = cfont.font[temp+zz];
			mask = 0x80;

			for ( i = 0 ; i < 8 ; i++ ) {

				newx = (int) (x + (((i+(zz*8)+(pos*cfont.x_size))*cos_radian)-((j)*sin_radian)));
				newy = (int) (y + (((j)*cos_radian)+((i+(zz*8)+(pos*cfont.x_size))*sin_radian)));

				if ( (ch & mask) != 0 ) _drawPixel(disp_handle, TFT_globals,
					newx,newy,TFT_globals->_fg, 0);

				else if (!TFT_globals->font_transparent) _drawPixel(disp_handle, TFT_globals,
					newx, newy, TFT_globals->_bg, 0);

