mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
				mask >>= 1;
			}
		}

		temp+=(fz);
	}

	// calculate x,y for the next char
	TFT_globals->TFT_X = (int) (x + ( (pos+1) * cfont.x_size * cos_radian) );
	TFT_globals->TFT_Y = (int) (y + ( (pos+1) * cfont.x_size * sin_radian) );
}



//----------------------
static int 
_7seg_width()
{
	return (2 * (2 * cfont.y_size + 1) ) + cfont.x_size;
}



//-----------------------
static int 
_7seg_height()
{
	return (3 * (2 * cfont.y_size + 1)) + (2 * cfont.x_size);
}



// Returns the string width in pixels.
// Useful for positions strings on the screen.
//===============================
int 
TFT_getStringWidth(TFTGlobals_t* TFT_globals, char* str)
{
	int strWidth = 0;

	if (cfont.bitmap == 2) strWidth = ((_7seg_width()+2) * strlen(str)) - 2;	// 7-segment font

	else if (cfont.x_size != 0) strWidth = strlen(str) * cfont.x_size;		// fixed width font

	else {
		// calculate the width of the string of proportional characters
		char* tempStrptr = str;

		while (*tempStrptr != 0) {

			if (getCharPtr(TFT_globals, *tempStrptr++)) {

				strWidth += (((fontChar.width > fontChar.xDelta) ? fontChar.width : fontChar.xDelta) + 1);
			}
		}

		strWidth--;
	}

	return strWidth;
}



//===============================================
void TFT_clearStringRect(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int x,
	int y,
	char *str)
{
	int w = TFT_getStringWidth(TFT_globals, str);

	int h = TFT_getfontheight();

	TFT_fillRect(disp_handle, TFT_globals, x + TFT_globals->dispWin.x1,
		y + TFT_globals->dispWin.y1, w, h, TFT_globals->_bg);
}



//==============================================================================
/**
 * bit-encoded bar position of all digits' bcd segments
 *
 *           6
 * 		  +-----+
 * 		3 |  .	| 2
 * 		  +--5--+
 * 		1 |  .	| 0
 * 		  +--.--+
 * 		     4
 */
static const uint16_t font_bcd[] = {
  0x200, // 0010 0000 0000  // -
  0x080, // 0000 1000 0000  // .
  0x06C, // 0100 0110 1100  // /, degree
  0x05f, // 0000 0101 1111, // 0
  0x005, // 0000 0000 0101, // 1
  0x076, // 0000 0111 0110, // 2
  0x075, // 0000 0111 0101, // 3
  0x02d, // 0000 0010 1101, // 4
  0x079, // 0000 0111 1001, // 5
  0x07b, // 0000 0111 1011, // 6
  0x045, // 0000 0100 0101, // 7
  0x07f, // 0000 0111 1111, // 8
  0x07d, // 0000 0111 1101  // 9
  0x900  // 1001 0000 0000  // :
};



//-----------------------------------------------------------------------------------------------
static void 
barVert(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	int16_t w,
	int16_t l,
	color_t color,
	color_t outline)
{
	_fillTriangle(disp_handle, TFT_globals, x+1, y+2*w, x+w, y+w+1, x+2*w-1, y+2*w, color);
	_fillTriangle(disp_handle, TFT_globals, x+1, y+2*w+l+1, x+w, y+3*w+l, x+2*w-1, y+2*w+l+1, color);
	_fillRect(disp_handle, TFT_globals, x, y+2*w+1, 2*w+1, l, color);

	if (cfont.offset) {

	_drawTriangle(disp_handle, TFT_globals, x+1, y+2*w, x+w, y+w+1, x+2*w-1, y+2*w, outline);
	_drawTriangle(disp_handle, TFT_globals, x+1, y+2*w+l+1, x+w, y+3*w+l, x+2*w-1, y+2*w+l+1, outline);
	_drawRect(disp_handle, TFT_globals, x, y+2*w+1, 2*w+1, l, outline);
	}
}



//----------------------------------------------------------------------------------------------
static void
barHor(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	int16_t w,
	int16_t l,
	color_t color,
	color_t outline) 
{
	_fillTriangle(disp_handle, TFT_globals, x+2*w, y+2*w-1, x+w+1, y+w, x+2*w, y+1, color);
	_fillTriangle(disp_handle, TFT_globals, x+2*w+l+1, y+2*w-1, x+3*w+l, y+w, x+2*w+l+1, y+1, color);
	_fillRect(disp_handle, TFT_globals, x+2*w+1, y, l, 2*w+1, color);

	if (cfont.offset) {

		_drawTriangle(disp_handle, TFT_globals, x+2*w, y+2*w-1, x+w+1, y+w, x+2*w, y+1, outline);
		_drawTriangle(disp_handle, TFT_globals, x+2*w+l+1, y+2*w-1, x+3*w+l, y+w, x+2*w+l+1, y+1, outline);
		_drawRect(disp_handle, TFT_globals, x+2*w+1, y, l, 2*w+1, outline);
	}
}



//--------------------------------------------------------------------------------------------
static void 
_draw7seg(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	int8_t num,
	int16_t w,
	int16_t l,
	color_t color)
{
  /* TODO: clipping */
  if (num < 0x2D || num > 0x3A) return;

  int16_t c = font_bcd[num-0x2D];
  int16_t d = 2 * w + l + 1;

  // === Clear unused segments ===
  if (!(c & 0x001)) barVert(disp_handle, TFT_globals, x+d, y+d, w, l, TFT_globals->_bg, TFT_globals->_bg);
  if (!(c & 0x002)) barVert(disp_handle, TFT_globals, x,   y+d, w, l, TFT_globals->_bg, TFT_globals->_bg);
  if (!(c & 0x004)) barVert(disp_handle, TFT_globals, x+d, y, w, l, TFT_globals->_bg, TFT_globals->_bg);
  if (!(c & 0x008)) barVert(disp_handle, TFT_globals, x,   y, w, l, TFT_globals->_bg, TFT_globals->_bg);
  if (!(c & 0x010)) barHor(disp_handle, TFT_globals, x, y+2*d, w, l, TFT_globals->_bg, TFT_globals->_bg);
  if (!(c & 0x020)) barHor(disp_handle, TFT_globals, x, y+d, w, l, TFT_globals->_bg, TFT_globals->_bg);
  if (!(c & 0x040)) barHor(disp_handle, TFT_globals, x, y, w, l, TFT_globals->_bg, TFT_globals->_bg);

  if (!(c & 0x080)) {

	// low point
	_fillRect(disp_handle, TFT_globals,
		x+(d/2), y+2*d, 2*w+1, 2*w+1, TFT_globals->_bg);

	if (cfont.offset) _drawRect(disp_handle, TFT_globals,
		x+(d/2), y+2*d, 2*w+1, 2*w+1, TFT_globals->_bg);
  }

  if (!(c & 0x100)) {

	// down middle point
	_fillRect(disp_handle, TFT_globals, x+(d/2),
		y+d+2*w+1, 2*w+1, l/2, TFT_globals->_bg);

	if (cfont.offset) _drawRect(disp_handle, TFT_globals,
		x+(d/2), y+d+2*w+1, 2*w+1, l/2, TFT_globals->_bg);
  }

  if (!(c & 0x800)) {

	// up middle point
	_fillRect(disp_handle, TFT_globals,
		x+(d/2), y+(2*w)+1+(l/2), 2*w+1, l/2, TFT_globals->_bg);

	if (cfont.offset) _drawRect(disp_handle, TFT_globals,
		x+(d/2), y+(2*w)+1+(l/2), 2*w+1, l/2, TFT_globals->_bg);
  }

  if (!(c & 0x200)) {

	// middle, minus
	_fillRect(disp_handle, TFT_globals,
		x+2*w+1, y+d, l, 2*w+1, TFT_globals->_bg);

	if (cfont.offset) _drawRect(disp_handle, TFT_globals,
		x+2*w+1, y+d, l, 2*w+1, TFT_globals->_bg);
  }

  // === Draw used segments ===
  if (c & 0x001) barVert(disp_handle, TFT_globals, x+d, y+d, w, l, color, cfont.color);	// down right
  if (c & 0x002) barVert(disp_handle, TFT_globals, x,   y+d, w, l, color, cfont.color);	// down left
  if (c & 0x004) barVert(disp_handle, TFT_globals, x+d, y, w, l, color, cfont.color);	// up right
  if (c & 0x008) barVert(disp_handle, TFT_globals, x,   y, w, l, color, cfont.color);	// up left
  if (c & 0x010) barHor(disp_handle, TFT_globals, x, y+2*d, w, l, color, cfont.color);	// down
  if (c & 0x020) barHor(disp_handle, TFT_globals, x, y+d, w, l, color, cfont.color);	// middle
  if (c & 0x040) barHor(disp_handle, TFT_globals, x, y, w, l, color, cfont.color);	// up

  if (c & 0x080) {

	// low point
	_fillRect(disp_handle, TFT_globals,
		x+(d/2), y+2*d, 2*w+1, 2*w+1, color);

	if (cfont.offset) _drawRect(disp_handle, TFT_globals,
		x+(d/2), y+2*d, 2*w+1, 2*w+1, cfont.color);
  }

  if (c & 0x100) {

	// down middle point
	_fillRect(disp_handle, TFT_globals,
		x+(d/2), y+d+2*w+1, 2*w+1, l/2, color);

	if (cfont.offset) _drawRect(disp_handle, TFT_globals,
		x+(d/2), y+d+2*w+1, 2*w+1, l/2, cfont.color);
  }

  if (c & 0x800) {
	// up middle point

