mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
	_fillRect(disp_handle, TFT_globals,
		x+(d/2), y+(2*w)+1+(l/2), 2*w+1, l/2, color);

	if (cfont.offset) _drawRect(disp_handle, TFT_globals,
		x+(d/2), y+(2*w)+1+(l/2), 2*w+1, l/2, cfont.color);
  }

  if (c & 0x200) {

	// middle, minus
	_fillRect(disp_handle, TFT_globals,
		x+2*w+1, y+d, l, 2*w+1, color);

	if (cfont.offset) _drawRect(disp_handle, TFT_globals,
		x+2*w+1, y+d, l, 2*w+1, cfont.color);
  }
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Print
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void TFT_print(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	char *st,
	int x,
	int y)
{
  int stl, i, tmpw, tmph, fh;
  uint8_t ch;

  if (cfont.bitmap == 0) return; // wrong font selected

  // ** Rotated strings cannot be aligned
  if ( ( TFT_globals->font_rotate != 0 ) && ( ( x <= CENTER ) || ( y <= CENTER ) ) ) return;

  if ( ( x < LASTX ) || (TFT_globals->font_rotate == 0 ) ) TFT_globals->TFT_OFFSET = 0;

  if ( ( x >= LASTX ) && ( x < LASTY ) ) x = TFT_globals->TFT_X + ( x - LASTX );

  else if (x > CENTER) x += TFT_globals->dispWin.x1;

  if ( y >= LASTY ) y = TFT_globals->TFT_Y + ( y - LASTY );

  else if ( y > CENTER ) y += TFT_globals->dispWin.y1;

  // ** Get number of characters in string to print
  stl = strlen(st);

  // ** Calculate CENTER, RIGHT or BOTTOM position
  tmpw = TFT_getStringWidth(TFT_globals, st);	// string width in pixels
  fh = cfont.y_size;			// font height

  if ( ( cfont.x_size != 0 ) && ( cfont.bitmap == 2 ) ) {

  	// 7-segment font
  	fh = (3 * (2 * cfont.y_size + 1)) + (2 * cfont.x_size);  // 7-seg character height
  }

  if (x == RIGHT) x = TFT_globals->dispWin.x2 - tmpw + TFT_globals->dispWin.x1;

  else if (x == CENTER) x = ( ( (TFT_globals->dispWin.x2 - TFT_globals->dispWin.x1 + 1) - tmpw) / 2) + TFT_globals->dispWin.x1;

  if ( y == BOTTOM ) y = TFT_globals->dispWin.y2 - fh + TFT_globals->dispWin.y1;

  else if ( y == CENTER ) y = ( ( (TFT_globals->dispWin.y2 - TFT_globals->dispWin.y1 + 1) - (fh/2)) / 2) + TFT_globals->dispWin.y1;

  if ( x < TFT_globals->dispWin.x1 ) x = TFT_globals->dispWin.x1;

  if ( y < TFT_globals->dispWin.y1 ) y = TFT_globals->dispWin.y1;

  if ( ( x > TFT_globals->dispWin.x2 ) || ( y > TFT_globals->dispWin.y2 ) ) return;

  TFT_globals->TFT_X = x;
  TFT_globals->TFT_Y = y;

  // ** Adjust y position
  tmph = cfont.y_size; // font height

  // for non-proportional fonts, char width is the same for all chars
  tmpw = cfont.x_size;

  if ( cfont.x_size != 0 ) {

	if ( cfont.bitmap == 2 ) {	// 7-segment font

		tmpw = _7seg_width();	// character width
		tmph = _7seg_height();	// character height
	}
  }

  else TFT_globals->TFT_OFFSET = 0;	// fixed font; offset not needed

  if ( ( TFT_globals->TFT_Y + tmph - 1 ) > TFT_globals->dispWin.y2 ) return;

  int offset = TFT_globals->TFT_OFFSET;

  for ( i = 0 ; i < stl ; i++ ) {

	ch = st[i]; // get string character

	if ( ch == 0x0D ) { // === '\r', erase to eol ====

		if ( ( !TFT_globals->font_transparent ) && ( TFT_globals->font_rotate == 0 ) )

			_fillRect(disp_handle, TFT_globals,
				TFT_globals->TFT_X, TFT_globals->TFT_Y,
				TFT_globals->dispWin.x2 + 1 - TFT_globals->TFT_X, tmph, TFT_globals->_bg);
		}

	else if ( ch == 0x0A ) { // ==== '\n', new line ====

		if ( cfont.bitmap == 1 ) {

			TFT_globals->TFT_Y += tmph + TFT_globals->font_line_space;

			if ( TFT_globals->TFT_Y > ( TFT_globals->dispWin.y2 - tmph ) ) break;

			TFT_globals->TFT_X = TFT_globals->dispWin.x1;
		}
	}

	else { // ==== other characters ====

		if ( cfont.x_size == 0 ) {

			// for proportional font get character data to 'fontChar'
			if ( getCharPtr(TFT_globals, ch) ) tmpw = fontChar.xDelta;

			else continue;
		}

		// check if character can be displayed in the current line
		if ( ( TFT_globals->TFT_X + tmpw ) > ( TFT_globals->dispWin.x2 ) ) {

			if ( TFT_globals->text_wrap == 0 ) break;

			TFT_globals->TFT_Y += tmph + TFT_globals->font_line_space;

			if ( TFT_globals->TFT_Y > (TFT_globals->dispWin.y2-tmph) ) break;

			TFT_globals->TFT_X = TFT_globals->dispWin.x1;
		}

		// Let's print the character
		if ( cfont.x_size == 0 ) {

			// == proportional font
			if ( TFT_globals->font_rotate == 0 ) TFT_globals->TFT_X += 
				printProportionalChar(disp_handle, TFT_globals, TFT_globals->TFT_X, TFT_globals->TFT_Y) + 1;

			else {
				// rotated proportional font
				offset += rotatePropChar(disp_handle, TFT_globals, x, y, offset);
				TFT_globals->TFT_OFFSET = offset;
			}
		}

		else {
			if ( cfont.bitmap == 1 ) {

				// == fixed font
				if ( ( ch < cfont.offset ) || ( ( ch-cfont.offset ) > cfont.numchars ) ) ch = cfont.offset;

				if ( TFT_globals->font_rotate == 0 ) {

					printChar(disp_handle, TFT_globals, ch, TFT_globals->TFT_X, TFT_globals->TFT_Y);

					TFT_globals->TFT_X += tmpw;
				}

				else rotateChar(disp_handle, TFT_globals, ch, x, y, i);
			}

			else if ( cfont.bitmap == 2) {

				// == 7-segment font ==
				_draw7seg(disp_handle, TFT_globals,
					TFT_globals->TFT_X, TFT_globals->TFT_Y, ch, cfont.y_size, cfont.x_size, TFT_globals->_fg);

				TFT_globals->TFT_X += (tmpw + 2);
			}
		}
	}
  }
}



// ================ Service functions ==========================================



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Set Rotation
 *  Desc: Change the screen rotation. m new rotation value (0 to 3)
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_setRotation(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint8_t rot)
{
  if ( rot > 3 ) {

	uint8_t madctl = (rot & 0xF8);

	ESP32_SPI_polling_transmit_cmd_and_data(disp_handle,
		TFT_MADCTL,
		&madctl, 1);
  }

  else {

	TFT_globals->orientation = rot;

