mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
        _tft_setRotation(disp_handle, TFT_globals, rot);
  }

  TFT_globals->dispWin.x1 = 0;
  TFT_globals->dispWin.y1 = 0;
  TFT_globals->dispWin.x2 = TFT_globals->_width - 1;
  TFT_globals->dispWin.y2 = TFT_globals->_height - 1;

  TFT_fillScreen(disp_handle, TFT_globals, TFT_globals->_bg);
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Invert Display
 *  Desc: Send the command to invert all of the colors. i 0 to disable inversion; non-zero to enable inversion
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void TFT_invertDisplay(ESP32_SPI_device_handle_t spi_device_handle,
	const uint8_t mode)
{
  if ( mode == INVERT_ON ) {

	ESP32_SPI_transfer_only_cmd(spi_device_handle, TFT_INVONN);
  }

  else {

	ESP32_SPI_transfer_only_cmd(spi_device_handle, TFT_INVOFF);
  }
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Set Gamma Curve
 *  Desc: Input: gamma = 0~3
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void TFT_setGammaCurve(ESP32_SPI_device_handle_t disp_handle,
	uint8_t gm)
{
  uint8_t gamma_curve = 1 << (gm & 0x03);

  ESP32_SPI_polling_transmit_cmd_and_data(disp_handle,
	TFT_CMD_GAMMASET,
	&gamma_curve,
	1);
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Convert HSB to RGB
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
color_t HSBtoRGB(float _hue,
	float _sat,
	float _brightness)
{
	float red = 0.0;
	float green = 0.0;
	float blue = 0.0;

	if (_sat == 0.0) {

		red = _brightness;
		green = _brightness;
		blue = _brightness;

	} else {

		if (_hue == 360.0) {

			_hue = 0;
		}

		int slice = (int)(_hue / 60.0);
		float hue_frac = (_hue / 60.0) - slice;

		float aa = _brightness * (1.0 - _sat);
		float bb = _brightness * (1.0 - _sat * hue_frac);
		float cc = _brightness * (1.0 - _sat * (1.0 - hue_frac));

		switch (slice) {

			case 0:

        		red = _brightness;
        		green = cc;
        		blue = aa;

         		break;

		case 1:

         		red = bb;
        		green = _brightness;
        		blue = aa;

        		break;

     		case 2:

         		red = aa;
         		green = _brightness;
         		blue = cc;

        		break;

    		case 3:

         		red = aa;
         		green = bb;
        		blue = _brightness;

        		break;

     		case 4:

         		red = cc;
         		green = aa;
         		blue = _brightness;

         		break;

     		case 5:

         		red = _brightness;
         		green = aa;
         		blue = bb;

         		break;

     		default:

        		red = 0.0;
        		green = 0.0;
         		blue = 0.0;

         		break;
		}
	}

	color_t color;
	color.r = ( (uint8_t) (red * 255.0) ) & 0xFC;
	color.g = ( (uint8_t) (green * 255.0) ) & 0xFC;
	color.b = ( (uint8_t) (blue * 255.0) ) & 0xFC;

	return color;
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Set Clipping Window
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void 
TFT_setclipwin(TFTGlobals_t* TFT_globals,
	uint16_t x1,
	uint16_t y1,
	uint16_t x2,
	uint16_t y2)
{
	TFT_globals->dispWin.x1 = x1;
	TFT_globals->dispWin.y1 = y1;
	TFT_globals->dispWin.x2 = x2;
	TFT_globals->dispWin.y2 = y2;

	if (TFT_globals->dispWin.x2 >= TFT_globals->_width) 
		TFT_globals->dispWin.x2 = TFT_globals->_width-1;

	if (TFT_globals->dispWin.y2 >= TFT_globals->_height) 
		TFT_globals->dispWin.y2 = TFT_globals->_height-1;

	if (TFT_globals->dispWin.x1 > TFT_globals->dispWin.x2) 
		TFT_globals->dispWin.x1 = TFT_globals->dispWin.x2;

	if (TFT_globals->dispWin.y1 > TFT_globals->dispWin.y2) 
		TFT_globals->dispWin.y1 = TFT_globals->dispWin.y2;
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Reset Clipping Window
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void TFT_resetclipwin(TFTGlobals_t* TFT_globals)
{
	TFT_globals->dispWin.x2 = TFT_globals->_width-1;
	TFT_globals->dispWin.y2 = TFT_globals->_height-1;
	TFT_globals->dispWin.x1 = 0;
	TFT_globals->dispWin.y1 = 0;
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Set 7 Segment Attribute
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void set_7seg_font_atrib(uint8_t l,
	uint8_t w,
	int outline,
	color_t color)
{
	if ( cfont.bitmap != 2 ) return;

	if ( l < 6 ) l = 6;
	if ( l > 40 ) l = 40;
	if ( w < 1 ) w = 1;
	if ( w > ( l/2 ) ) w = l/2;
	if ( w > 12 ) w = 12;

	cfont.x_size = l;
	cfont.y_size = w;
	cfont.offset = outline;
	cfont.color  = color;
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Get Font Size
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
int TFT_getfontsize(int *width,
	int* height)
{
	if (cfont.bitmap == 1) {

		if ( cfont.x_size != 0 ) *width = cfont.x_size;	// fixed width font

		else *width = cfont.max_x_size;			// proportional font

		*height = cfont.y_size;
	}

	else if ( cfont.bitmap == 2 ) {

		// 7-segment font
		*width = _7seg_width();
		*height = _7seg_height();
	}

	else {

