mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
		*width = 0;
		*height = 0;

		return 0;
	}
  return 1;
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Get Font Height
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
int TFT_getfontheight()
{
	if ( cfont.bitmap == 1 ) return cfont.y_size;		// Bitmap font

	else if (cfont.bitmap == 2) return _7seg_height();	// 7-segment font

	return 0;
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Save Clipping Window
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void TFT_saveClipWin(TFTGlobals_t* TFT_globals)
{
	TFT_globals->dispWinTemp.x1 = TFT_globals->dispWin.x1;
	TFT_globals->dispWinTemp.y1 = TFT_globals->dispWin.y1;
	TFT_globals->dispWinTemp.x2 = TFT_globals->dispWin.x2;
	TFT_globals->dispWinTemp.y2 = TFT_globals->dispWin.y2;
}



/** Public function
 * -------------------------------------------------------------------------------------------------
 *  FName: Restore Clipping Window
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
void TFT_restoreClipWin(TFTGlobals_t* TFT_globals)
{
	TFT_globals->dispWin.x1 = TFT_globals->dispWinTemp.x1;
	TFT_globals->dispWin.y1 = TFT_globals->dispWinTemp.y1;
	TFT_globals->dispWin.x2 = TFT_globals->dispWinTemp.x2;
	TFT_globals->dispWin.y2 = TFT_globals->dispWinTemp.y2;
}



// ================ JPG SUPPORT ================================================
// User defined device identifier
typedef struct {
	FILE* fhndl;		// File handler for input function
	int x;			// image top left point X position
	int y;			// image top left point Y position
	uint8_t* membuff;	// memory buffer containing the image
	uint32_t bufsize;	// size of the memory buffer
	uint32_t bufptr;	// memory buffer current position
	color_t* linbuf[2];	// memory buffer used for display output
	uint8_t	linbuf_idx;
} JPGIODEV;



// User defined call-back function to input JPEG data from file
//---------------------
static UINT 
tjd_input( JDEC* jd,		// Decompression object
	BYTE* buff,		// Pointer to the read buffer (NULL:skip)
	uint nd)		// Number of bytes to read/skip from input stream
{
	int rb = 0;

	// Device identifier for the session (5th argument of jd_prepare function)
	JPGIODEV *dev = (JPGIODEV*) jd->device;

	if (buff) {	// Read nd bytes from the input strem

		rb = fread(buff, 1, nd, dev->fhndl);
		return rb;	// Returns actual number of bytes read
	}

	else {	// Remove nd bytes from the input stream

		if (fseek(dev->fhndl, nd, SEEK_CUR) >= 0) return nd;
		else return 0;
	}
}



// User defined call-back function to input JPEG data from memory buffer
//-------------------------
static UINT 
tjd_buf_input(JDEC* jd,		// Decompression object
	BYTE* buff,		// Pointer to the read buffer (NULL:skip)
	UINT nd)		// Number of bytes to read/skip from input stream
{
	// Device identifier for the session (5th argument of jd_prepare function)
	JPGIODEV *dev = (JPGIODEV*)jd->device;
	if (!dev->membuff) return 0;

	if (dev->bufptr >= (dev->bufsize + 2)) return 0; // end of stream

	if ((dev->bufptr + nd) > (dev->bufsize + 2)) nd = (dev->bufsize + 2) - dev->bufptr;

	if (buff) {	// Read nd bytes from the input strem

		memcpy(buff, dev->membuff + dev->bufptr, nd);
		dev->bufptr += nd;
		return nd;	// Returns number of bytes read
	}

	else {	// Remove nd bytes from the input stream

		dev->bufptr += nd;
		return nd;
	}
}

// User defined call-back function to output RGB bitmap to display device
//----------------------
static UINT 
tjd_output(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	JDEC* jd,		// Decompression object of current session
	void* bitmap,		// Bitmap data to be output
	JRECT* rect)		// Rectangular region to output
{
	// Device identifier for the session (5th argument of jd_prepare function)
	JPGIODEV *dev = (JPGIODEV*)jd->device;

	// ** Put the rectangular into the display device **
	int x;
	int y;
	int dleft, dtop, dright, dbottom;
	BYTE *src = (BYTE*)bitmap;

	int left = rect->left + dev->x;
	int top = rect->top + dev->y;
	int right = rect->right + dev->x;
	int bottom = rect->bottom + dev->y;

	if ( (left > TFT_globals->dispWin.x2) || (top > TFT_globals->dispWin.y2) ) return 1;	// out of screen area, return
	if ( (right < TFT_globals->dispWin.x1) || (bottom < TFT_globals->dispWin.y1) ) return 1;	// out of screen area, return

	if (left < TFT_globals->dispWin.x1) dleft = TFT_globals->dispWin.x1;
	else dleft = left;

	if (top < TFT_globals->dispWin.y1) dtop = TFT_globals->dispWin.y1;
	else dtop = top;

	if (right > TFT_globals->dispWin.x2) dright = TFT_globals->dispWin.x2;
	else dright = right;

	if (bottom > TFT_globals->dispWin.y2) dbottom = TFT_globals->dispWin.y2;
	else dbottom = bottom;

	if ( (dleft > TFT_globals->dispWin.x2) || (dtop > TFT_globals->dispWin.y2) ) return 1;		// out of screen area, return
	if ( (dright < TFT_globals->dispWin.x1) || (dbottom < TFT_globals->dispWin.y1) ) return 1;	// out of screen area, return

	uint32_t len = ((dright-dleft+1) * (dbottom-dtop+1));	// calculate length of data


	if ((len > 0) && (len <= JPG_IMAGE_LINE_BUF_SIZE)) {

		uint8_t *dest = (uint8_t *)(dev->linbuf[dev->linbuf_idx]);

		for (y = top; y <= bottom; y++) {

			for (x = left; x <= right; x++) {

				// Clip to display area
				if ((x >= dleft) && (y >= dtop) && (x <= dright) && (y <= dbottom)) {

					*dest++ = (*src++) & 0xFC;
					*dest++ = (*src++) & 0xFC;
					*dest++ = (*src++) & 0xFC;
				}

				else src += 3; // skip
			}
		}

		send_data(disp_handle, TFT_globals, dleft, dtop, dright, dbottom, len, dev->linbuf[dev->linbuf_idx]);

