mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
		dev->linbuf_idx = ((dev->linbuf_idx + 1) & 1);
	}
	else {
//log3
printf("Data size error: %d jpg: (%d,%d,%d,%d) disp: (%d,%d,%d,%d)\r\n", len, left,top,right,bottom, dleft,dtop,dright,dbottom);

		return 0;  // stop decompression
	}

	return 1;	// Continue to decompression
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: 
 *  Desc: 
 *  Info: 
 *  Para:  ->  
 
 *  Rets:  -> 
 * -------------------------------------------------------------------------------------------------
 */
// tft.jpgimage(X, Y, scale, file_name, buf, size]
// X & Y can be < 0 !
//==================================================================================
void 
TFT_jpg_image(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int x,
	int y,
	uint8_t scale,
	char *fname,
	uint8_t *buf,
	int size)
{
	JPGIODEV dev;
    	struct stat sb;
	char *work = NULL;		// Pointer to the working buffer (must be 4-byte aligned)
	UINT sz_work = 3800;	// Size of the working buffer (must be power of 2)
	JDEC jd;				// Decompression object (70 bytes)
	JRESULT rc;

	dev.linbuf[0] = NULL;
	dev.linbuf[1] = NULL;
    	dev.linbuf_idx = 0;

   	dev.fhndl = NULL;

	if (fname == NULL) {

    		// image from buffer
       		dev.membuff = buf;
       		dev.bufsize = size;
       		dev.bufptr = 0;
	}

	else {

		// image from file
        	dev.membuff = NULL;
        	dev.bufsize = 0;
       		dev.bufptr = 0;

        	if (stat(fname, &sb) != 0) {

			if (TFT_globals->image_debug) 
				printf("File error: %ss\r\n", strerror(errno));

			goto exit;
		}

		dev.fhndl = fopen(fname, "r");

		if (!dev.fhndl) {

			if (TFT_globals->image_debug) printf("Error opening file: %s\r\n", strerror(errno));

			goto exit;
        	}
    	}

	if (scale > 3) scale = 3;

	work = malloc(sz_work);

	if (work) {

		if (dev.membuff) rc = jd_prepare(&jd, tjd_buf_input, (void *)work, sz_work, &dev);

		else rc = jd_prepare(&jd, tjd_input, (void *)work, sz_work, &dev);

		if (rc == JDR_OK) {

			if (x == CENTER) x = ((TFT_globals->dispWin.x2 - TFT_globals->dispWin.x1 + 1 - (int)(jd.width >> scale)) / 2) + TFT_globals->dispWin.x1;
			else if (x == RIGHT) x = TFT_globals->dispWin.x2 + 1 - (int)(jd.width >> scale);

			if (y == CENTER) y = ((TFT_globals->dispWin.y2 - TFT_globals->dispWin.y1 + 1 - (int)(jd.height >> scale)) / 2) + TFT_globals->dispWin.y1;
			else if (y == BOTTOM) y = TFT_globals->dispWin.y2 + 1 - (int)(jd.height >> scale);

			if (x < ((TFT_globals->dispWin.x2-1) * -1)) x = (TFT_globals->dispWin.x2-1) * -1;
			if (y < ((TFT_globals->dispWin.y2-1)) * -1) y = (TFT_globals->dispWin.y2-1) * -1;
			if (x > (TFT_globals->dispWin.x2-1)) x = TFT_globals->dispWin.x2 - 1;
			if (y > (TFT_globals->dispWin.y2-1)) y = TFT_globals->dispWin.y2-1;

			dev.x = x;
			dev.y = y;

			dev.linbuf[0] = heap_caps_malloc(JPG_IMAGE_LINE_BUF_SIZE*3, MALLOC_CAP_DMA);

			if (dev.linbuf[0] == NULL) {
				if (TFT_globals->image_debug) printf("Error allocating line buffer #0\r\n");
				goto exit;
			}

			dev.linbuf[1] = heap_caps_malloc(JPG_IMAGE_LINE_BUF_SIZE*3, MALLOC_CAP_DMA);

			if (dev.linbuf[1] == NULL) {
				if (TFT_globals->image_debug) printf("Error allocating line buffer #1\r\n");
				goto exit;
			}

			// Start to decode the JPEG file
			rc = jd_decomp(&jd, tjd_output, scale);

			if (rc != JDR_OK) {

				if (TFT_globals->image_debug) printf("jpg decompression error %d\r\n", rc);
			}

			if (TFT_globals->image_debug) printf("Jpg size: %dx%d, position; %d,%d, scale: %d, bytes used: %d\r\n", jd.width, jd.height, x, y, scale, jd.sz_pool);
		}

		else {

			if (TFT_globals->image_debug) printf("jpg prepare error %d\r\n", rc);
		}
	}

	else {

		if (TFT_globals->image_debug) printf("work buffer allocation error\r\n");
	}

exit:
	if (work) free(work);  // free work buffer

	if (dev.linbuf[0]) free(dev.linbuf[0]);

	if (dev.linbuf[1]) free(dev.linbuf[1]);

	if (dev.fhndl) fclose(dev.fhndl);  // close input file
}



//====================================================================================
int 
TFT_bmp_image(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int x,
	int y,
	uint8_t scale,
	char *fname,
	uint8_t *imgbuf,
	int size)
{
	FILE *fhndl = NULL;

	struct stat sb;

	int i, err=0;

	int img_xsize, img_ysize, img_xstart, img_xlen, img_ystart, img_ylen;
	int img_pos, img_pix_pos, scan_lines, rd_len;

	uint8_t tmpc;
	uint16_t wtemp;
	uint32_t temp;

	int disp_xstart, disp_xend, disp_ystart, disp_yend;

	uint8_t buf[56];

	char err_buf[64];

	uint8_t *line_buf[2] = {NULL,NULL};

	uint8_t lb_idx = 0;

	uint8_t *scale_buf = NULL;

	uint8_t scale_pix;

	uint16_t co[3] = {0,0,0};			// RGB sum

	uint8_t npix;

	if (scale > 7) scale = 7;

	scale_pix = scale+1;	// scale factor ( 1~8 )

    	if (fname) {

		// * File name is given, reading image from file
    		if (stat(fname, &sb) != 0) {

			sprintf(err_buf, "opening file");
    			err = -1;

    			goto exit;
    		}

		size = sb.st_size;

		fhndl = fopen(fname, "r");

		if (!fhndl) {

			sprintf(err_buf, "opening file");
			err = -2;
			goto exit;
		}

		i = fread(buf, 1, 54, fhndl);  // read header
	}

	else {

    		// * Reading image from buffer
    		if ((imgbuf) && (size > 54)) {

    			memcpy(buf, imgbuf, 54);
    			i = 54;
    		}

    		else i = 0;
	}

	sprintf(err_buf, "reading header");

	if (i != 54) {err = -3;	goto exit;}

	// ** Check image header and get image properties
	if ((buf[0] != 'B') || (buf[1] != 'M')) {err=-4; goto exit;} // accept only images with 'BM' id

	memcpy(&temp, buf+2, 4);			// file size
	if (temp != size) {err=-5; goto exit;}

	memcpy(&img_pos, buf+10, 4);			// start of pixel data

	memcpy(&temp, buf+14, 4);			// BMP header size
	if (temp != 40) {err=-6; goto exit;}

	memcpy(&wtemp, buf+26, 2);			// the number of color planes
	if (wtemp != 1) {err=-7; goto exit;}

	memcpy(&wtemp, buf+28, 2);			// the number of bits per pixel
	if (wtemp != 24) {err=-8; goto exit;}

