mattehicks/SCDE/components/ESP32_TouchGUI1_Module/tft.c
	memcpy(&temp, buf+30, 4);			// the compression method being used
	if (temp != 0) {err=-9; goto exit;}

	memcpy(&img_xsize, buf+18, 4);			// the bitmap width in pixels
	memcpy(&img_ysize, buf+22, 4);			// the bitmap height in pixels


	// * scale image dimensions

	img_xlen = img_xsize / scale_pix;		// image display horizontal size
	img_ylen = img_ysize / scale_pix;		// image display vertical size

	if (x == CENTER) x = ((TFT_globals->dispWin.x2 - TFT_globals->dispWin.x1 + 1 - img_xlen) / 2) + TFT_globals->dispWin.x1;
	else if (x == RIGHT) x = TFT_globals->dispWin.x2 + 1 - img_xlen;

	if (y == CENTER) y = ((TFT_globals->dispWin.y2 - TFT_globals->dispWin.y1 + 1 - img_ylen) / 2) + TFT_globals->dispWin.y1;
	else if (y == BOTTOM) y = TFT_globals->dispWin.y2 + 1 - img_ylen;

	if ((x < ((TFT_globals->dispWin.x2 + 1) * -1)) || (x > (TFT_globals->dispWin.x2 + 1)) || (y < ((TFT_globals->dispWin.y2 + 1) * -1)) || (y > (TFT_globals->dispWin.y2 + 1))) {
		sprintf(err_buf, "out of display area (%d,%d", x, y);
		err = -10;
		goto exit;
	}

	// ** set display and image areas
	if (x < TFT_globals->dispWin.x1) {
		disp_xstart = TFT_globals->dispWin.x1;
		img_xstart = -x;	// image pixel line X offset
		img_xlen += x;
	}

	else {
		disp_xstart = x;
		img_xstart = 0;
	}

	if (y < TFT_globals->dispWin.y1) {
		disp_ystart = TFT_globals->dispWin.y1;
		img_ystart = -y;	// image pixel line Y offset
		img_ylen += y;
	}

	else {
		disp_ystart = y;
		img_ystart = 0;
	}

	disp_xend = disp_xstart + img_xlen - 1;
	disp_yend = disp_ystart + img_ylen - 1;

	if (disp_xend > TFT_globals->dispWin.x2) {

		disp_xend = TFT_globals->dispWin.x2;
		img_xlen = disp_xend - disp_xstart + 1;
	}

	if (disp_yend > TFT_globals->dispWin.y2) {

		disp_yend = TFT_globals->dispWin.y2;
		img_ylen = disp_yend - disp_ystart + 1;
	}

	if ((img_xlen < 8) || (img_ylen < 8) || (img_xstart >= (img_xsize-2)) || ((img_ysize - img_ystart) < 2)) {

		sprintf(err_buf, "image too small");
		err = -11;
		goto exit;
	}

	// ** Allocate memory for 2 lines of image pixels
	line_buf[0] = heap_caps_malloc(img_xsize*3, MALLOC_CAP_DMA);

	if (line_buf[0] == NULL) {

	    sprintf(err_buf, "allocating line buffer #1");
		err=-12;
		goto exit;
	}

	line_buf[1] = heap_caps_malloc(img_xsize*3, MALLOC_CAP_DMA);

	if (line_buf[1] == NULL) {

	    sprintf(err_buf, "allocating line buffer #2");
		err=-13;
		goto exit;
	}

	if (scale) {

		// Allocate memory for scale buffer
		rd_len = img_xlen * 3 * scale_pix;

		scale_buf = malloc(rd_len*scale_pix);

		if (scale_buf == NULL) {
			sprintf(err_buf, "allocating scale buffer");
			err=-14;
			goto exit;
		}
	}

	else rd_len = img_xlen * 3;

	// ** ***************************************************** **
	// ** BMP images are stored in file from LAST to FIRST line **
	// ** ***************************************************** **

	/* Used variables:
		img_xsize		horizontal image size in pixels
		img_ysize		number of image lines
		img_xlen 		image display horizontal scaled size in pixels
		img_ylen		image display vertical scaled size in pixels
		img_xstart		first pixel in line to be displayed
		img_ystart		first image line to be displayed
		img_xlen		number of pixels in image line to be displayed, starting with 'img_xstart'
		img_ylen		number of lines in image to be displayed, starting with 'img_ystart'
		rd_len			length of color data which are read from image line in bytes
	 */

	// Set position in image to the first color data (beginning of the LAST line)
	img_pos += (img_ystart * (img_xsize*3));

	if (fhndl) {

		if (fseek(fhndl, img_pos, SEEK_SET) != 0) {

			sprintf(err_buf, "file seek at %d", img_pos);
			err = -15;
			goto exit;
		}
	}

	if (TFT_globals->image_debug) printf("BMP: image size: (%d,%d) scale: %d disp size: (%d,%d) img xofs: %d img yofs: %d at: %d,%d; line buf: 2* %d scale buf: %d\r\n",
			img_xsize, img_ysize, scale_pix, img_xlen, img_ylen, img_xstart, img_ystart, disp_xstart, disp_ystart, img_xsize*3, ((scale) ? (rd_len*scale_pix) : 0));

	while ((disp_yend >= disp_ystart) && ((img_pos + (img_xsize*3)) <= size)) {

		if (img_pos > size) {
			sprintf(err_buf, "EOF reached: %d > %d", img_pos, size);
			err = -16;
			goto exit1;
		}

		if (scale == 0) {

			// Read the line of color data into color buffer
			if (fhndl) {
				i = fread(line_buf[lb_idx], 1, img_xsize*3, fhndl);  // read line from file
				if (i != (img_xsize*3)) {
					sprintf(err_buf, "file read at %d (%d<>%d)", img_pos, i, img_xsize*3);
					err = -16;
					goto exit1;
				}
			}

			else memcpy(line_buf[lb_idx], imgbuf+img_pos, img_xsize*3);

			if (img_xstart > 0) memmove(line_buf[lb_idx], line_buf[lb_idx]+(img_xstart*3), rd_len);

			// Convert colors BGR-888 (BMP) -> RGB-888 (DISPLAY) ===
			for (i=0; i < rd_len; i += 3) {
				tmpc = line_buf[lb_idx][i+2] & 0xfc;				// save R
				line_buf[lb_idx][i+2] = line_buf[lb_idx][i] & 0xfc;	// B -> R
				line_buf[lb_idx][i] = tmpc;							// R -> B
				line_buf[lb_idx][i+1] &= 0xfc;						// G
			}

			img_pos += (img_xsize*3);
		}

		else {
			// scale image, read 'scale_pix' lines and find the average color
			for (scan_lines=0; scan_lines<scale_pix; scan_lines++) {

				if (img_pos > size) break;

				if (fhndl) {

					i = fread(line_buf[lb_idx], 1, img_xsize*3, fhndl);  // read line from file

					if (i != (img_xsize*3)) {
						sprintf(err_buf, "file read at %d (%d<>%d)", img_pos, i, img_xsize*3);
						err = -17;
						goto exit1;
					}
				}

				else memcpy(line_buf[lb_idx], imgbuf+img_pos, img_xsize*3);

				img_pos += (img_xsize*3);

				// copy only data which are displayed to scale buffer
				memcpy(scale_buf + (rd_len * scan_lines), line_buf[lb_idx]+img_xstart, rd_len);
			}

			// Populate display line buffer
			for (int n=0;n<(img_xlen*3);n += 3) {

				memset(co, 0, sizeof(co));	// initialize color sum

				npix = 0;			// initialize number of pixels in scale rectangle

